[
  {
    "path": "news/RJ-2021-1-bioc/",
    "title": "News from the Bioconductor Project",
    "description": {},
    "author": [
      {
        "name": "Bioconductor Core Team",
        "url": {}
      }
    ],
    "date": "2021-07-01",
    "categories": [],
    "contents": "\n\n\nd-title h1, d-title p, d-title figure {\n  grid-column: page;\n}\n\n\n  \n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-08-04T13:46:30+10:00",
    "input_file": {}
  },
  {
    "path": "news/RJ-2021-1-core/",
    "title": "Changes in R 4.0–4.1",
    "description": {},
    "author": [
      {
        "name": "Tomas Kalibera",
        "url": {}
      },
      {
        "name": "Sebastian Meyer",
        "url": {}
      },
      {
        "name": "Kurt Hornik",
        "url": {}
      }
    ],
    "date": "2021-07-01",
    "categories": [],
    "contents": "\n\n\nd-title h1, d-title p, d-title figure {\n  grid-column: page;\n}\n\n\n  \n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-08-04T13:46:30+10:00",
    "input_file": {}
  },
  {
    "path": "news/RJ-2021-1-cran/",
    "title": "Changes on CRAN",
    "description": {},
    "author": [
      {
        "name": "Kurt Hornik",
        "url": {}
      },
      {
        "name": "Uwe Ligges",
        "url": {}
      },
      {
        "name": "Achim Zeileis",
        "url": {}
      }
    ],
    "date": "2021-07-01",
    "categories": [],
    "contents": "\n\n\nd-title h1, d-title p, d-title figure {\n  grid-column: page;\n}\n\n\n  \n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-08-04T13:46:30+10:00",
    "input_file": {}
  },
  {
    "path": "news/RJ-2021-1-forwards-news/",
    "title": "News from the Forwards Taskforce",
    "description": {},
    "author": [
      {
        "name": "Heather Turner",
        "url": {}
      }
    ],
    "date": "2021-07-01",
    "categories": [],
    "contents": "\n\n\nd-title h1, d-title p, d-title figure {\n  grid-column: page;\n}\n\n\n  \n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-08-04T13:46:30+10:00",
    "input_file": {}
  },
  {
    "path": "news/RJ-2021-1-foundation/",
    "title": "R Foundation News",
    "description": {},
    "author": [
      {
        "name": "Torsten Hothorn",
        "url": {}
      }
    ],
    "date": "2021-07-01",
    "categories": [],
    "contents": "\n\n\nd-title h1, d-title p, d-title figure {\n  grid-column: page;\n}\n\n\n  \n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-08-04T13:46:30+10:00",
    "input_file": {}
  },
  {
    "path": "news/RJ-2021-1-rmed2020/",
    "title": "R Medicine 2020: The Power of Going Virtual",
    "description": {},
    "author": [
      {
        "name": "Elizabeth J. Atkinson",
        "url": {}
      },
      {
        "name": "Peter D. Higgins",
        "url": {}
      },
      {
        "name": "Denise Esserman",
        "url": {}
      },
      {
        "name": "Michael J. Kane",
        "url": {}
      },
      {
        "name": "Steven J. Schwager,",
        "url": {}
      }
    ],
    "date": "2021-07-01",
    "categories": [],
    "contents": "\n\n\nd-title h1, d-title p, d-title figure {\n  grid-column: page;\n}\n\n\n  \n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-08-04T13:46:30+10:00",
    "input_file": {}
  },
  {
    "path": "news/RJ-2021-1-whyr2021/",
    "title": "Conference Report of Why R? Turkey 2021",
    "description": {},
    "author": [
      {
        "name": "Mustafa Cavus",
        "url": {}
      },
      {
        "name": "Olgun Aydin",
        "url": {}
      },
      {
        "name": "Ozan Evkaya",
        "url": {}
      },
      {
        "name": "Ozancan Ozdemir",
        "url": {}
      },
      {
        "name": "Deniz Bezer",
        "url": {}
      },
      {
        "name": "Ugur Dar",
        "url": {}
      }
    ],
    "date": "2021-07-01",
    "categories": [],
    "contents": "\n\n\nd-title h1, d-title p, d-title figure {\n  grid-column: page;\n}\n\n\n  \n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-08-04T13:46:30+10:00",
    "input_file": {}
  },
  {
    "path": "news/RJ-2021-1-editorial/",
    "title": "Editorial",
    "description": {},
    "author": [
      {
        "name": "Dianne Cook",
        "url": "https://journal.r-project.org"
      }
    ],
    "date": "2021-07-01",
    "categories": [],
    "contents": "\nOn behalf of the editorial board, I am pleased to present Volume 13 Issue 1 of the R Journal.\nFirst, some news about the journal board. Welcome to Gavin Simpson, who joins as a new Executive Editor! In addition, welcome to our new Associate Editors Nicholas Tierney, Isabella Gollini, Rasmus Bth, Mark van der Loo, Elizabeth Sweeney, Louis Aslett and Katarina Domijan. With the large volume of submissions, the Associate Editors now play a vital role in processing articles.\nThere are some new developments in the journal operations under way. We are working on a new package rjtools which will operate a little like the devtools package and help you to create a new article from a template, and check that it conforms to the style and requirements of the R Journal.\nWe are also working on supporting articles written in RMarkdown, which will be rendered in html through a modified distill web site. The exciting feature is that interactive graphics could be included directly in the article. You can see how this current issue would look in the new style at https://rjournal.r-project.org/dev. Particularly, look at articles Conversations in Time by Wang and Cook as an example that has two examples of how interactive graphics might be included. Other articles rendered in html are “Finding Optimal Normalizing Transformations” by Peterson, “Automating Reproducible, Collaborative Clinical Trial Document Generation” by Kane, Jiang and Urbanek, and “Towards a Grammar for Processing Clinical Trial Data” by Kane. All remaining articles in the new site style are the current pdf style.\nTo experiment with creating a new article, or to check that your article, conforms with the R Journal author guidelines, go to https://rjournal.github.io/rjtools/. Note that it is still ok to use the rticles package R Journal Rmarkdown template to create your article. This will generate the files that are compiled to pdf using latex, but it is an easy translation for us to convert them into the new style.\nThe operational support and the experiments have been supported with generous funding from the R Consortium (https://www.r-consortium.org).\nBehind the scenes, several people are assisting with the journal operations and the new developments. Mitchell O’Hara-Wild has worked on infrastructure, the new article submission system, a new issue build system and now the new article delivery system providing html format. H. Sherry Zhang has taken over from Stephanie Kobakian, in developing the rjtools package including check functions for new articles to help authors get the style constraints correct. In addition, articles in this issue have been painstakingly copy edited by Dewi Amaliah.\nIn this issue\nNews from the R Core, CRAN, Bioconductor, the R Foundation, and the foRwards Taskforce are included in this issue along with a summary of activities at the R Medicine and Why R? 2021 conferences.\nThis issue features 37 contributed research articles covering these topics:\nMultivariate analysis\nSeedCCA: An integrated R-package for Canonical Correlation Analysis and Partial Least Squares\nUnidimensional and Multidimensional Methods for Recurrence Quantification Analysis with crqa\nclustcurv: An R Package for Determining Groups in Multiple Curves\ngofCopula: Goodness-of-Fit Tests for Copulae\nROCnReg: An R Package for Receiver Operating Characteristic Curve Inference With and Without Covariates\n\nNon-parametric methods\nnpcure: An R Package for Nonparametric Inference in Mixture Cure Models\nROBustness In Network (robin): an R package for Comparison and Validation of Communities\nkrippendorffsalpha: An R Package for Measuring Agreement Using Krippendorff’s Alpha Coefficient\n\nTemporal and longitudinal methods\nJMcmprsk: An R Package for Joint Modelling of Longitudinal and Survival Data with Competing Risks\nLinear Regression with Stationary Errors: the R Package slm\npenPHcure: Variable Selection in Proportional Hazards Cure Model with Time-Varying Covariates\npdynmc: A Package for Estimating Linear Dynamic Panel Data Models Based on Nonlinear Moment Conditions\nDChaos: An R Package for Chaotic Time Series Analysis\nIndexNumber: An R Package for Measuring the Evolution of Magnitudes\ngarchx: Flexible and Robust GARCH-X Modelling\nWorking with CRSP/COMPUSTAT in R: Reproducible Empirical Asset Pricing\nAnalysing Dependence Between Point Processes in Time Using IndTestPP\nConversations in Time: Interactive Visualisation to Explore Structured Temporal Data\n\nComputing infrastructure\nA Method for Deriving Information from Running R Code\nWide-to-tall Data Reshaping Using Regular Expressions and the nc Package\nThe bdpar Package: Big Data Pipelining Architecture for R\nBenchmarking R packages for calculation of Persistent Homology\ndistr6: R6 Object-Oriented Probability Distributions Interface in R\nAutomating Reproducible, Collaborative Clinical Trial Document Generation\nReproducible Summary Tables with the gtsummary Package\nTowards a Grammar for Processing Clinical Trial Data\n\nSimulation and optimisation\nFinding Optimal Normalizing Transformations via bestNormalize\nPackage wsbackfit for Smooth Backfitting Estimation of Generalized Structured Models\nRLumCarlo: Simulating Cold Light using Monte Carlo Methods\nOneStep: Le Cam’s one-step estimation procedure\nThe  Hydrological Model\nRegularized Transformation Models: The tramnet Package\n\nOther topics\nexPrior: An R Package for the Formulation of Ex-Situ Priors\nBayesSPsurv: An R Package to Estimate Bayesian (Spatial) Split-Population Survival Models\nStatistical Quality Control with the qcr Package\nThe R Package smicd: Statistical Methods for Interval-Censored Data\nstratamatch: Prognostic Score Stratification Using a Pilot Design\n\nHappy reading, and code testing!\n\n\n\n",
    "preview": {},
    "last_modified": "2021-08-10T01:56:51+10:00",
    "input_file": "editorial.knit.md"
  }
]
