[
  {
    "path": "issues/2020-1/",
    "title": "Volume 12/1",
    "description": "Articles published in the June 2020 issue",
    "author": [],
    "date": "2020-06-01",
    "categories": [],
    "contents": "\n\n\nd-article > * {\n    grid-column: page;\n}\n\nComplete issue \nComplete bibliography\n\nTable of contents\n\nEditorialMichael J. Kane 4\nContributed Research Articles\ngk: An R Package for the g-and-k and Generalised g-and-h DistributionsDennis Prangle 7\nNlinTS: An R Package For Causality Detection in Time SeriesYoussef Hmamouche 21\nMapping Smoothed Spatial Effect Estimates from Individual-Level Data: MapGAMLu Bai, Daniel L. Gillen, Scott M. Bartell and Verónica M. Vieira 32\nmudfold: An R Package for Nonparametric IRT Modelling of Unfolding ProcessesSpyros E. Balafas, Wim P. Krijnen, Wendy J. Post and Ernst C. Wit 49\ntsmp: An R Package for Time Series with Matrix ProfileFrancisco Bischoff and Pedro Pereira Rodrigues 76\nIndividual-Level Modelling of Infectious Disease Data: EpiILMVineetha Warriyar K. V., Waleed Almutiry and Rob Deardon 87\nSurvBoost: An R Package for High-Dimensional Variable Selection in the Stratified Proportional Hazards Model via Gradient BoostingEmily Morris, Kevin He, Yanming Li, Yi Li and Jian Kang 105\nCoxPhLb: An R Package for Analyzing Length Biased Data under Cox ModelChi Hyun Lee, Heng Zhou, Jing Ning, Diane D. Liu and Yu Shen 118\nSortedEffects: Sorted Causal Effects in RShuowen Chen, Victor Chernozhukov, Iván Fernández-Val and Ye Luo 131\nnpordtests: An R Package of Nonparametric Tests for Equality of Location Against Ordered AlternativesBulent Altunkaynak and Hamza Gamgam 147\nlspartition: Partitioning-Based Least Squares RegressionMatias D. Cattaneo, Max H. Farrell and Yingjie Feng 172\nSkew-t Expected Information Matrix Evaluation and Use for Standard Error CalculationsR. Douglas Martin, Chindhanai Uthaisaad and Daniel Z. Xia 188\nrcosmo: R Package for Analysis of Spherical, HEALPix and Cosmological DataDaniel Fryer, Ming Li and Andriy Olenko 206\nTools for Analyzing R Code the Tidy WayLucy D’Agostino McGowan, Sean Kross and Jeffrey Leek 226\nspinifex: An R Package for Creating a Manual Tour of Low-dimensional Projections of Multivariate DataNicholas Spyrison and Dianne Cook 243\nari: The Automated R InstructorSean Kross, Jeffrey T. Leek and John Muschelli 258\nCopulaCenR: Copula based Regression Models for Bivariate Censored Data in RTao Sun and Ying Ding 266\nmistr: A Computational Framework for Mixture and Composite DistributionsLukas Sablica and Kurt Hornik 283\ndifNLR: Generalized Logistic Regression Models for DIF and DDF DetectionAdéla Hladká and Patrícia Martinková 300\nBayesMallows: An R Package for the Bayesian Mallows ModelØystein Sørensen, Marta Crispino, Qinghua Liu and Valeria Vitelli 324\nVariable Importance Plots—An Introduction to the vip PackageBrandon M. Greenwell and Bradley C. Boehmke 343\nSimilaR: R Code Clone and Plagiarism DetectionMaciej Bartoszuk and Marek Gagolewski 367\nLinear Fractional Stable Motion with the rlfsm R PackageStepan Mazur and Dmitry Otryakhin 386\nThe R package NonProbEst for estimation in non-probability surveysM. Rueda, R. Ferri-García and L. Castro 406\nProjectManagement: an R Package for Managing ProjectsJuan Carlos Gonçalves-Dosantos, Ignacio García-Jurado and Julián Costa 419\nThe Rockerverse: Packages and Applications for Containerisation with RDaniel Nüst, Dirk Eddelbuettel, Dom Bennett, Robrecht Cannoodt, Dav Clark, Gergely Daróczi, Mark Edmondson, Colin Fay, Ellis Hughes, Lars Kjeldgaard, Sean Lopp, Ben Marwick, Heather Nolis, Jacqueline Nolis, Hong Ooi, Karthik Ram, Noam Ross, Lori Shepherd, Péter Sólymos, Tyson Lee Swetnam, Nitesh Turaga, Charlotte Van Petegem, Jason Williams, Craig Willis and Nan Xiao 437\nSpecial Articles\nS, R, and Data ScienceJohn M. Chambers 462\nProvenance of R’s Gradient OptimizersJohn C. Nash 477\nNews and Notes\nConference Report: Why R? 2019Michał Burdukiewicz, Filip Pietluch, Jarosław Chilimoniuk, Katarzyna Sidorczuk, Dominik Rafacz, Leon Eyrich Jessen, Stefan Rödiger, Marcin Kosin ́ski and Piotr Wójcik 484\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 485\nR Foundation NewsTorsten Hothorn 498\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-05-12T10:45:45+10:00",
    "input_file": {}
  }
]
