[
  {
    "path": "issues/2025-3/",
    "title": "Volume 17/3",
    "description": "Articles published in the September 2025 issue",
    "author": [],
    "date": "2025-09-01",
    "categories": [],
    "contents": "\n \n\nComplete issue \nTable of contents\nEditorialRob J Hyndman 3\nContributed Research Articles\nlsirm12pl: An R Package for the Latent Space Item Response ModelDongyoung Go, Gwanghee Kim, Jina Park, Junyong Park, Minjeong Jeon and Ick Hoon Jin 4\nConverting LaTeX Legacy R Journal Articles into R Markdown Articles using texor and rebibAbhishek Ulayil, Dianne Cook, Heather Turner, Mitchell O’Hara-Wild and Christophe Dervieux 30\nFeature-Based Time-Series Analysis in R using the Theft EcosystemTrent Henderson and Ben D. Fulcher 43\nQTE.RD: An R Package for Quantile Treatment Effects in Regression-Discontinuity DesignsZhongjun Qu and Jungmo Yoon 69\nBoundaryStats: An R Package to Calculate Boundary Overlap StatisticsAmy Luo 89\nR package GofCens: Goodness-of-Fit Methods for Right-Censored DataMireia Besalú, Klaus Langohr, Matilde Francisco, Arnau Garcia-Fernández and Guadalupe Gómez Melis 100\nmoonboot: An R Package Implementing m-out-of-n Bootstrap MethodsChristoph Dalitz and Felix Lögler 125\nRgof and R2sample: Testing and Benchmarking for the Univariate Goodness-of-Fit and Two-Sample ProblemsWolfgang Rolke 138\nRendering LaTeX in RPaul Murrell 162\nlqmix: an R Package for Longitudinal Data Analysis via Linear Quantile MixturesMarco Alfó, Maria Francesca Marino, Maria Giovanna Ranalli and Nicola Salvati 188\nExploring Image Analysis in R: Applications and AdvancementsTim Brauckhoff, Julius Rublack and Stefan Rödiger 212\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:03+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2025-2/",
    "title": "Volume 17/2",
    "description": "Articles published in the June 2025 issue",
    "author": [],
    "date": "2025-06-01",
    "categories": [],
    "contents": "\n \n\nComplete issue \nTable of contents\nEditorialRob J Hyndman 3\nContributed Research Articles\nThe CRAN Task View InitiativeAchim Zeileis, Roger Bivand, Dirk Eddelbuettel, Kurt Hornik, Julia Piaskowski and Nathalie Vialaneix 4\nboinet: An R Package for Bayesian Optimal Interval Design for Dose Finding Based on Both Efficacy and Toxicity OutcomesYusuke Yamaguchi, Kentaro Takeda and Kazushi Maruo 15\nPartitioned Local Depth (PaLD) Community Analyses in RLucy D’Agostino McGowan, Katherine Moore and Kenneth S. Berenhaut 35\nStudent t-Lévy regression model in yuimaHiroki Masuda, Lorenzo Mercuri and Yuma Uehara 56\nSfislands: An R Package for Accommodating Islands and Disjoint Zones in Areal Spatial ModellingKevin Horan, Katarina Domijan and Chris Brunsdon 84\nrPDBapi: A Comprehensive R Package Interface for Accessing the Protein Data BankSelcuk Korkmaz and Bilge Eren Yamasan 109\nrqPen: An R Package for Penalized Quantile RegressionBen Sherwood, Shaobo Li and Adam Maidman 146\nbartcs: An R Package for Bayesian Nonparametric Adjustment for ConfoundingYeonghoon Yoo and Chanmin Kim (corresponding author) 176\nMSmix: An R Package for clustering partial rankings via mixtures of Mallows Models with Spearman distanceMarta Crispino, Cristina Mollica and Lucia Modugno 206\nCvmortalityMult: Cross-Validation for Multi-Population Mortality ModelsDavid Atance and Ana Debón 231\nNews and Notes\nBioconductor Notes, September 2025Maria Doyle, Bioconductor Community Manager and Bioconductor Core Developer Team 258\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 262\nR Foundation NewsTorsten Hothorn 264\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:03+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2025-1/",
    "title": "Volume 17/1",
    "description": "Articles published in the March 2025 issue",
    "author": [],
    "date": "2025-03-01",
    "categories": [],
    "contents": "\n \n\nComplete issue \nTable of contents\nEditorialRob J Hyndman 3\nContributed Research Articles\nSIREN: A Hybrid CFA-EFA R Package for Controlling Acquiescence in Restricted Factorial SolutionsDavid Navarro-Gonzalez, Pere J. Ferrando, Fabia Morales-Vives and Ana Hernandez-Dorado 5\nRandom Forests for Time-Fixed and Time-Dependent Predictors: The DynForest R PackageAnthony Devaux, Cécile Proust-Lima and Robin Genuer 24\nLCCR: An R Package for Inference on Latent Class Models for Capture-Recapture Data with CovariatesFrancesco Bartolucci and Antonio Forcina 47\nspheresmooth: An R Package for Penalized Piecewise Geodesic Curve Fitting on a SphereJae-Hwan Jhong, Seyoung Lee, Ja-Yong Koo and Kwan-Young Bak 67\nSpace-Time Smoothing of Survey Outcomes using the R Package SUMMERZehang Richard Li, Bryan D Martin, Tracy Qi Dong, Geir-Arne Fuglstad, Jessica Godwin, John Paige, Andrea Riebler, Samuel J Clark and Jon Wakefield 88\nlatrend: A Framework for Clustering Longitudinal DataNiek Den Teuling, Steffen Pauws and Edwin van den Heuvel 108\nStructured Bayesian Regression Tree Models for Estimating Distributed Lag Effects: The R Package dlmtreeSeongwon Im, Ander Wilson and Daniel Mork 136\nCDsampling: An R Package for Constrained D-Optimal Sampling in Paid Research StudiesYifei Huang, Liping Tong and Jie Yang 160\npanelPomp: Analysis of Panel Data via Partially Observed Markov Processes in RCarles Bretó, Jesse Wheeler, Aaron A. King and Edward L. Ionides 180\nSimEngine: A Modular Framework for Statistical Simulations in RAvi Kenny and Charles J. Wolock 200\nNews and Notes\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 221\nR Foundation NewsTorsten Hothorn 223\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:03+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2024-4/",
    "title": "Volume 16/4",
    "description": "Articles published in the December 2024 issue",
    "author": [],
    "date": "2024-12-01",
    "categories": [],
    "contents": "\n \n\nComplete issue \nTable of contents\nEditorialMark P.J. van der Loo 3\nContributed Research Articles\nsurvivalSL: an R Package for Predicting Survival by a Super LearnerCamille Sabathe and Yohann Foucher 4\nIRTest: An R Package for Item Response Theory with Estimation of Latent DistributionSeewoo Li 23\nSplinets – Orthogonal Splines for Functional Data AnalysisRani Basna, Hiba Nassar and Krzysztof Podgórski 42\nDisaggregating Time-Series with Many Indicators: An Overview of the DisaggregateTS PackageLuke Mosley, Kaveh Salehzadeh Nobari, Giuseppe Brandi and Alex Gibberd 62\nLMest: An R Package for Estimating Generalized Latent Markov ModelsFulvia Pennoni, Silvia Pandolfi and Francesco Bartolucci 74\nCalculating Standardised Indices Using SEISam Allen and Noelia Otero 102\nMultiStatM: Multivariate Statistical Methods in RGyörgy Terdik and Emanuele Taufer 123\nCanonical Correlation Analysis of Survey Data: The SurveyCC R PackageRaul Cruz-Cano, Aaron Cohen and Erin Mead-Morse 141\nGPUmatrix: Seamlessly harness the power of GPU computing in RCésar Lobato-Fernández, Juan A. Ferrer-Bonsoms and Angel Rubio 158\nUpAndDownPlots: An R Package for Displaying Absolute and Percentage ChangesAntony Unwin 179\nNews and Notes\nBioconductor Notes, December 2024Maria Doyle, Bioconductor Community Manager and Bioconductor Core Developer Team 194\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 198\nNews from the Forwards TaskforceHeather Turner 200\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:03+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2024-3/",
    "title": "Volume 16/3",
    "description": "Articles published in the September 2024 issue",
    "author": [],
    "date": "2024-09-01",
    "categories": [],
    "contents": "\n \n\nComplete issue \nTable of contents\nEditorialMark P.J. van der Loo 3\nContributed Research Articles\nValidating and Extracting Information from National Identification Numbers in R: The Case of Finland and SwedenPyry Kantanen, Erik Bülow, Aleksi Lahtinen, Måns Magnusson, Jussi Paananen and Leo Lahti 4\nGeoAdjust: Adjusting for Positional Uncertainty in Geostatistial Analysis of DHS DataUmut Altay, John Paige, Andrea Riebler and Geir-Arne Fuglstad 15\nSIHR: Statistical Inference in High-Dimensional Linear and Logistic Regression ModelsPrabrisha Rakshit, Zhenyu Wang, Tony Cai and Zijian Guo 27\nSNSeg: An R Package for Time Series Segmentation via Self-NormalizationShubo Sun, Zifeng Zhao, Feiyu Jiang and Xiaofeng Shao 46\nfmeffects: An R Package for Forward Marginal EffectsHolger Löwe, Christian A. Scholbeck, Christian Heumann, Bernd Bischl and Giuseppe Casalicchio 67\nGSSTDA: Implementation in an R Package of the Progression of Disease with Survival Analysis (PAD-S) that Integrates Information on Genes Linked to Survival in the Mapper Filter FunctionMiriam Esteve, Raquel Bosch-Romeu, Antonio Falco, Jaume Fores and Joan Climent 90\nKernel Heaping - Kernel Density Estimation from regional aggregates via measurement error modelLorena Gril, Laura Steinkemper, Marcus Groß and Ulrich Rendtel 115\nSLCARE: An R Package for Semiparametric Latent Class Analysis of Recurrent EventsQi Yu and Limin Peng 134\nPubChemR: An R Package for Accessing Chemical Data from PubChemSelcuk Korkmaz, Bilge Eren Yamasan and Dincer Goksuluk 150\nboiwsa: An R Package for Seasonal Adjustment of Weekly DataTim Ginker 186\nNews and Notes\nBioconductor Notes, September 2024Maria Doyle, Bioconductor Community Manager and Bioconductor Core Developer Team 198\nR Foundation NewsTorsten Hothorn 201\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:03+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2024-2/",
    "title": "Volume 16/2",
    "description": "Articles published in the June 2024 issue",
    "author": [],
    "date": "2024-06-01",
    "categories": [],
    "contents": "\n \n\nComplete issue \nTable of contents\nEditorialMark P.J. van der Loo 3\nContributed Research Articles\nLUCIDus: An R Package For Implementing Latent Unknown Clustering By Integrating Multi-omics Data (LUCID) With Phenotypic TraitsYinqi Zhao, Qiran Jia, Jesse A. Goodrich and David V. Conti 4\nCurrent State and Prospects of R-Packages for the Design of ExperimentsEmi Tanaka and Dewi Amaliah 27\nBCClong: An R Package for Bayesian Consensus Clustering for Multiple Longitudinal FeaturesZhiwen Tan, Chang Shen and Zihang Lu 41\nreslr: An R Package for Relative Sea Level ModellingMaeve Upton, Andrew Parnell and Niamh Cahill 61\nRfssa: An R Package for Functional Singular Spectrum AnalysisHossein Haghbin, Jordan Trinka and Mehdi Maadooliat 82\nmcmsupply: An R Package for Estimating Contraceptive Method Market Supply SharesHannah Comiskey and Niamh Cahill 99\nPomdp: A Computational Infrastructure for Partially Observable Markov Decision ProcessesMichael Hahsler and Anthony R. Cassandra 116\npencal: an R Package for the Dynamic Prediction of Survival with Many Longitudinal PredictorsMirko Signorelli 134\nclarify: Simulation-Based Inference for Regression ModelsNoah Greifer, Steven Worthington, Stefano Iacus and Gary King 154\nFuzzySimRes: Epistemic Bootstrap – an Efficient Tool for Statistical Inference Based on Imprecise DataMaciej Romaniuk, Przemysław Grzegorzewski and Abbas Parchami 175\nFast and Flexible Search for Homologous Biological Sequences with DECIPHER v3Erik S. Wright 191\nNews and Notes\nBioconductor Notes, June 2024Maria Doyle, Bioconductor Community Manager and Bioconductor Core Developer Team 201\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 203\nChanges in RTomas Kalibera and Sebastian Meyer 205\nR Foundation NewsTorsten Hothorn 211\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:02+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2024-1/",
    "title": "Volume 16/1",
    "description": "Articles published in the March 2024 issue",
    "author": [],
    "date": "2024-03-01",
    "categories": [],
    "contents": "\n \n\nComplete issue \nTable of contents\nEditorialMark P.J. van der Loo 3\nContributed Research Articles\nRemembering Friedrich “Fritz” LeischBettina Grün, Kurt Hornik, Torsten Hothorn, Theresa Scharl and Achim Zeileis 5\nebmstate: An R Package For Disease Progression Analysis Under Empirical Bayes Cox ModelsRui J. Costa and Moritz Gerstung 15\nbootCT: An R Package for Bootstrap Cointegration Tests in ARDL ModelsGianmarco Vacca, Maria Zoia and Stefano Bertelli 39\nPrediction, Bootstrapping and Monte Carlo Analyses Based on Linear Mixed Models with QAPE 2.0 PackageAlicja Wolny–Dominiak and Tomasz Ża̧dło 67\ntext2sdg: An R Package to Monitor Sustainable Development Goals from TextDominik S. Meier, Rui Mata and Dirk U. Wulff 83\nGenMarkov: Modeling Generalized Multivariate Markov Chains in RCarolina Vasconcelos and Bruno Damásio 96\nFitting a Quantile Regression Model for Residual Life with the R Package qrisKyu Hyun Kim, Sangwook Kang and Sy Han Chiou 114\nnortsTest: An R Package for Assessing Normality of Stationary ProcessesAsael Alonzo Matamoros, Alicia Nieto-Reyes and Claudio Agostinelli 135\nshinymgr: A Framework for Building, Managing, and Stitching Shiny Modules into Reproducible WorkflowsLaurence A. Clarfeld, Caroline Tang and Therese Donovan 157\nBayesian Model Selection with Latent Group-Based Effects and Variances with the R Package slgfThomas A. Metzger and Christopher T. Franck 175\nBMRMM: An R Package for Bayesian Markov (Renewal) Mixed ModelsYutong Wu and Abhra Sarkar 192\nNews and Notes\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 212\nR Foundation NewsTorsten Hothorn 214\nBioconductor Notes, March 2024Maria Doyle, Bioconductor Community Manager and Bioconductor Core Developer Team 216\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:02+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2023-4/",
    "title": "Volume 15/4",
    "description": "Articles published in the December 2023 issue",
    "author": [],
    "date": "2023-12-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialSimon Urbanek 3\nContributed Research Articles\nSIMEXBoost: An R package for Analysis of High-Dimensional Error-Prone Data Based on Boosting MethodLi-Pang Chen and Bangxu Qiu 5\nbinGroup2: Statistical Tools for Infection Identification via Group TestingChristopher R. Bilder, Brianna D. Hitt, Brad J. Biggerstaff, Joshua M. Tebbs and Christopher S. McMahan 21\nmultiocc: An R Package for Spatio-Temporal Occupancy Models for Multiple SpeciesStaci Hepler and Robert Erhardt 37\nAccessible Computation of Tight Symbolic Bounds on Causal Effects using an Intuitive Graphical InterfaceGustav Jonzon, Michael C Sachs and Erin E Gabriel 53\nsingR: An R Package for Simultaneous Non-Gaussian Component Analysis for Data IntegrationLiangkang Wang, Irina Gaynanova and Benjamin Risk 69\nRobustCalibration: Robust Calibration of Computer Models in RMengyang Gu 84\nglmmPen: High Dimensional Penalized Generalized Linear Mixed ModelsHillary M. Heiling, Naim U. Rashid, Quefeng Li and Joseph G. Ibrahim 106\nUnified ROC Curve Estimator for Diagnosis and Prognosis Studies: The sMSROC PackageSusana Díaz-Coto, Pablo Martínez-Camblor and Norberto Corral-Blanco 129\nSparse Model Matrices for Multidimensional Hierarchical AggregationØyvind Langsrud 150\nopenalexR: An R-Tool for Collecting Bibliometric Data from OpenAlexMassimo Aria, Trang Le, Corrado Cuccurullo, Alessandra Belfiore and June Choe 167\nComputer Algebra in R Bridges a Gap Between Symbolic Mathematics and Data in the Teaching of Statistics and Data ScienceMikkel Meyer Andersen and Søren Højsgaard 181\nA Comparison of R Tools for Nonlinear Least Squares ModelingJohn C. Nash and Arkajyoti Bhattacharjee 198\nexvatools: Value Added in Exports and Other Input-Output Table Analysis ToolsEnrique Feás 216\nPLreg: An R Package for Modeling Bounded Continuous DataFrancisco F. Queiroz and Silvia L.P. Ferrari 236\nInference for Network Count Time Series with the R Package PNARMirko Armillotta, Michail Tsagris and Konstantinos Fokianos 255\nSUrvival Control Chart EStimation Software in R: the success PackageDaniel Gomon, Marta Fiocco, Hein Putter and Mirko Signorelli 270\nNews and Notes\nChanges in RTomas Kalibera and Sebastian Meyer 292\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 295\nNews from the Forwards TaskforceHeather Turner 297\nR Foundation NewsTorsten Hothorn 299\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:02+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2023-3/",
    "title": "Volume 15/3",
    "description": "Articles published in the September 2023 issue",
    "author": [],
    "date": "2023-09-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialSimon Urbanek 3\nContributed Research Articles\nVariety and Mainstays of the R Developer CommunityLijin Zhang, Xueyang Li and Zhiyong Zhang 5\nSSNbayes: An R Package for Bayesian Spatio-Temporal Modelling on Stream NetworksEdgar Santos-Fernandez, Jay M. Ver Hoef, James McGree, Daniel J. Isaak, Kerrie Mengersen and Erin E. Peterson 26\nC443: An R package to See a Forest for the TreesAniek Sies, Iven Van Mechelen and Kristof Meers 59\nTwoSampleTest.HD: An R Package for the Two-Sample Problem with High-Dimensional DataMarta Cousido-Rocha and Jacobo de Uña-Álvarez 79\nStatistical Models for Repeated Categorical Ratings: The R Package raterJeffrey M. Pullin, Lyle C. Gurrin and Damjan Vukcevic 93\nGREENeR: An R Package to Estimate and Visualize Nutrients Pressures on Surface WatersAngel Udías, Bruna Grizzetti, Olga Vigiak, Alberto Aloe, Cesar Alfaro and Javier Gomez 119\nbayesassurance: An R Package for Calculating Sample Size and Bayesian AssuranceJane Pan and Sudipto Banerjee 138\nfasano.franceschini.test: An Implementation of a Multivariate KS Test in RConnor Puritz, Elan Ness-Cohn and Rosemary Braun 159\nBayesian Inference for Multivariate Spatial Models with INLAFrancisco Palmí-Perales, Virgilio Gómez-Rubio, Roger S. Bivand, Michela Cameletti and Håvard Rue 172\nTwo-Stage Sampling Design and Sample Selection with the R Package R2BEATGiulio Barcaroli, Andrea Fasulo, Alessio Guandalini and Marco D. Terribili 191\nfnets: An R Package for Network Estimation and Forecasting via Factor-Adjusted VAR ModellingDom Owens, Haeran Cho and Matteo Barigozzi 214\nColoring in R’s Blind SpotAchim Zeileis and Paul Murrell 240\nUpdates to the R Graphics Engine: One Person’s Chart Junk is Another’s Chart TreasurePaul Murrell 257\nmathml: Translate R Expressions to MathML and LaTeXMatthias Gondan and Irene Alfarone 277\nNews and Notes\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 292\nR Foundation NewsTorsten Hothorn 294\nNews from BioconductorBioconductor Core Developers 296\nR Project Sprint 2023Heather Turner and Gabriel Becker 299\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:02+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2023-2/",
    "title": "Volume 15/2",
    "description": "Articles published in the June 2023 issue",
    "author": [],
    "date": "2023-06-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialSimon Urbanek 3\nContributed Research Articles\nnlstac: Non-Gradient Separable Nonlinear Least Squares FittingJ. A. F. Torvisco, R. Benítez, M. R. Arias and J. Cabello Sánchez 5\nhydrotoolbox, a Package for Hydrometeorological Data ManagementEzequiel Toum and Pierre Pitte 25\nbqror: An R package for Bayesian Quantile Regression in Ordinal ModelsPrajual Maheshwari and Mohammad Arshad Rahman 39\nGaussian Mixture Models in RBastien Chassagnol, Antoine Bichat, Cheïma Boudjeniba, Pierre-Henri Wuillemin, Mickaël Guedj, David Gohel, Gregory Nuel and Etienne Becht 56\nmutualinf: An R Package for Computing and Decomposing the Mutual Information Index of SegregationRafael Fuentealba-Chaura, Daniel Guinea-Martin, Ricardo Mora and Julio Rojas-Mora 77\nA Workflow for Estimating and Visualising Excess Mortality During the COVID-19 PandemicGaryfallos Konstantinoudis, Virgilio Gómez-Rubio, Michela Cameletti, Monica Pirani, Gianluca Baio and Marta Blangiardo 89\nGeneralized Estimating Equations using the new R package glmtoolboxL.H. Vanegas, L.M. Rondón and G.A. Paula 105\nclustAnalytics: An R Package for Assessing Stability and Significance of Communities in NetworksMartí Renedo-Mirambell and Argimiro Arratia 134\nPINstimation: An R Package for Estimating Probability of Informed Trading ModelsMontasser Ghachem and Oguz Ersan 145\nEviewsR: An R Package for Dynamic and Reproducible Research Using EViews, R, R Markdown and QuartoSagiru Mati, Irfan Civcir and S. I. Abba 169\nlangevitour: Smooth Interactive Touring of High Dimensions, Demonstrated with scRNA-Seq DataPaul Harrison 206\nggdensity: Improved Bivariate Density Visualization in RJames Otto and David Kahle 220\nThree-Way Correspondence Analysis in RRosaria Lombardo, Michel van de Velden and Eric J. Beh 237\nEstimating Heteroskedastic and Instrumental Variable Models for Binary Outcome Variables in RMauricio Sarrias 263\ngenpathmox: An R Package to Tackle Numerous Categorical Variables and Heterogeneity in Partial Least Squares Structural Equation ModelingGiuseppe Lamberti, 294\nTaking the Scenic Route: Interactive and Performant Tour AnimationsCasper Hart and Earo Wang 309\nIdentifying Counterfactual Queries with the R Package cfidSanttu Tikka 332\nvivid: An R package for Variable Importance and Variable Interactions Displays for Machine Learning ModelsAlan Inglis, Andrew Parnell and Catherine Hurley 346\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:02+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2023-1/",
    "title": "Volume 15/1",
    "description": "Articles published in the March 2023 issue",
    "author": [],
    "date": "2023-03-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialSimon Urbanek 4\nContributed Research Articles\nA Hexagon Tile Map Algorithm for Displaying Spatial DataStephanie Kobakian, Dianne Cook and Earl Duncan 6\nA Clustering Algorithm to Organize Satellite Hotspot Data for the Purpose of Tracking Bushfires RemotelyWeihao Li, Emily Dodwell and Dianne Cook 17\nasteRisk - Integration and Analysis of Satellite Positional Data in RRafael Ayala, Daniel Ayala, Lara Sellés Vidal and David Ruiz 34\ngplsim: An R Package for Generalized Partially Linear Single-index ModelsTianhai Zu and Yan Yu 55\nNon-Parametric Analysis of Spatial and Spatio-Temporal Point PatternsJonatan A. González and Paula Moraga 65\nnlmeVPC: Visual Model Diagnosis for the Nonlinear Mixed Effect ModelEun-Hwa Kang, Myungji Ko and Eun-Kyung Lee 83\nLikelihood Ratio Test-Based Drug Safety Assessment using R Package Saptarshi Chakraborty, Marianthi Markatou and Robert Ball 101\nGCPBayes: An R package for studying Cross-Phenotype Genetic Associations with Group-level Bayesian Meta-AnalysisTaban Baghfalaki, Pierre-Emmanuel Sugier, Yazdan Asgari, Thérèse Truong and Benoit Liquet 122\nrankFD: An R Software Package for Nonparametric Analysis of General Factorial DesignsFrank Konietschke and Edgar Brunner 142\nThe segmetric Package: Metrics for Assessing Segmentation Accuracy for Geospatial DataRolf Simoes, Alber Sanchez, Michelle C. A. Picoli and Patrick Meyfroidt 159\nOnlineforecast: An R Package for Adaptive and Recursive ForecastingPeder Bacher, Hjörleifur G. Bergsteinsson, Linde Frölke, Mikkel L. Sørensen, Julian Lemos-Vinasco, Jon Liisberg, Jan Kloppenborg Møller, Henrik Aalborg Nielsen and Henrik Madsen 173\nmarkovMSM: An R Package for Checking the Markov Condition in Multi-State Survival DataGustavo Soutinho and Luís Meira-Machado 195\nRobust Functional Linear Regression ModelsUfuk Beyaztas and Han Lin Shang 212\nFairness Audits and Debiasing Using Florian Pfisterer, Siyi Wei, Sebastian Vollmer, Michel Lang and Bernd Bischl 234\nClusROC: An R Package for ROC Analysis in Three-Class Classification Problems for Clustered DataDuc-Khanh To, Gianfranco Adimari and Monica Chiogna 254\nResampling Fuzzy Numbers with Statistical Applications: FuzzyResampling PackageMaciej Romaniuk and Przemysław Grzegorzewski 271\ncombinIT: An R Package for Combining Interaction Tests for Unreplicated Two-Way TablesMahmood Kharrati-Kopaei, Zahra Shenavari and Hossein Haghbin 284\nEstimating Causal Effects using Bayesian Methods with the R Package BayesCACEJincheng Zhou, Jinhui Yang, James S. Hodges, Lifeng Lin and Haitao Chu 297\nA Framework for Producing Small Area Estimates Based on Area-Level Models in RSylvia Harmening, Ann-Kristin Kreutzmann, Sören Schmidt, Nicola Salvati and Timo Schmid 316\nNews and Notes\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 342\nR Foundation NewsTorsten Hothorn 344\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:02+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2022-4/",
    "title": "Volume 14/4",
    "description": "Articles published in the December 2022 issue",
    "author": [],
    "date": "2022-12-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialCatherine Hurley 4\nContributed Research Articles\nknitrdata: A Tool for Creating Standalone Rmarkdown Source DocumentsDavid M. Kaplan 6\nnetgwas: An R Package for Network-Based Genome Wide Association StudiesPariya Behrouzi, Danny Arends and Ernst C. Wit 18\nrobslopes: Efficient Computation of the (Repeated) Median SlopeJakob Raymaekers 38\nGeneralized Mosaic Plots in the ggplot2 FrameworkHaley Jeppson and Heike Hofmann 50\nA Study in Reproducibility: The Congruent Matching Cells Algorithm and cmcR PackageJoseph Zemmels, Susan VanderPlas and Heike Hofmann 79\nBootstrapping Clustered Data in R using lmeresamplerAdam Loy and Jenna Korobova 103\nDGLMExtPois: Advances in Dealing with Over and Under-dispersion in a Double GLM FrameworkAntonio J. Sáez-Castillo, Antonio Conde-Sánchez and Francisco Martínez 121\nMaking Provenance Work for YouBarbara Lerner, Emery Boose, Orenna Brand, Aaron M. Ellison, Elizabeth Fong, Matthew Lau, Khanh Ngo, Thomas Pasquier, Luis A. Perez, Margo Seltzer, Rose Sheehan and Joseph Wonsil 141\nremap: Regionalized Models with Spatially Smooth PredictionsJadon Wagstaff and Brennan Bean 160\nHostSwitch: An R Package to Simulate the Extent of Host-Switching by a ConsumerValeria Trivellone, Sabrina B. L. Araujo and Bernd Panassiti 179\nOTrecod: An R Package for Data Fusion using Optimal Transportation TheoryGregory Guernec, Valerie Gares, Jeremy Omer, Philippe Saint-Pierre and Nicolas Savy 195\npopulR: a Package for Population Downscaling in RMarios Batsaris and Dimitris Kavroudakis 223\ndycdtools: an R Package for Assisting Calibration and Visualising Outputs of an Aquatic Ecosystem ModelSongyan Yu, Christopher G. McBride, Marieke A. Frassl, Matthew R. Hipsey and David P. Hamilton 235\nSurvMetrics: An R package for Predictive Evaluation Metrics in Survival AnalysisHanpu Zhou, Hong Wang*, Sizheng Wang and Yi Zou 252\nLimitations in Detecting Multicollinearity due to Scaling Issues in the mcvis PackageRoman Salmeron Gomez, Catalina B. Garcia Garcia, Ainara Rodriguez Sanchez and Claudia Garcia Garcia 264\nppseq: An R Package for Sequential Predictive Probability MonitoringEmily C. Zabor, Brian P. Hobbs and Michael J. Kane 280\npCODE: Estimating Parameters of ODE ModelsHaixu Wang and Jiguo Cao 291\nTreeSearch: Morphological Phylogenetic Analysis in RMartin R. Smith 305\nThe openVA Toolkit for Verbal AutopsiesZehang Richard Li, Jason Thomas, Eungang Choi, Tyler H. McCormick and Samuel J Clark 316\nBayesPPD: An R Package for Bayesian Sample Size Determination Using the Power and Normalized Power Prior for Generalized Linear ModelsYueqi Shen, Matthew A. Psioda and Joseph G. Ibrahim 335\nNews and Notes\nBioconductor NotesMaria Doyle and Bioconductor Core Developer Team 352\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 356\nNews from the Forwards TaskforceHeather Turner 358\nChanges in RTomas Kalibera, Sebastian Meyer and Kurt Hornik 361\nR Foundation NewsTorsten Hothorn 365\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:02+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2022-3/",
    "title": "Volume 14/3",
    "description": "Articles published in the September 2022 issue",
    "author": [],
    "date": "2022-09-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialCatherine Hurley 4\nContributed Research Articles\nIntroducing fastpos: A Fast R Implementation to Find the Critical Point of Stability for a CorrelationJohannes Titz 5\nWLinfer: Statistical Inference for Weighted Lindley DistributionYu-Hyeong Jang, SungBum Kim, Hyun-Ju Jung and Hyoung-Moon Kim (Corresponding author)\nICAOD: An R Package for Finding Optimal designs for Nonlinear Statistical Models by Imperialist Competitive AlgorithmEhsan Masoudi, Heinz Holling, Weng Kee Wong and Seongho Kim 20\nAnalysis of the Results of Metadynamics Simulations by metadynminer and metadynminer3dDalibor Trapl and Vojtech Spiwok 46\ncasebase: An Alternative Framework for Survival Analysis and Comparison of Event RatesSahir Rai Bhatnagar, Maxime Turgeon, Jesse Islam, James A. Hanley and Olli Saarela 59\ndbcsp: User-friendly R package for Distance-Based Common Spatial PatternsItsaso Rodríguez, Itziar Irigoien, Basilio Sierra and Concepción Arenas 80\nThe R Package HDSpatialScan for the Detection of Clusters of Multivariate and Functional Data using Spatial Scan StatisticsCamille Frévent, Mohamed-Salem Ahmed, Julien Soula, Lionel Cucala, Zaineb Smida, Sophie Dabo-Niang and Michaël Genin 95\nHDiR: An R Package for Computation and Nonparametric Plug-in Estimation of Directional Highest Density Regions and General Level SetsPaula Saavedra-Nieves and Rosa M. Crujeiras 121\nmetapack: An R Package for Bayesian Meta-Analysis and Network Meta-Analysis with a Unified Formula InterfaceDaeyoung Lim, Ming-Hui Chen, Joseph G. Ibrahim, Sungduk Kim, Arvind K. Shah and Jianxin Lin 142\ndid2s: Two-Stage Difference-in-DifferencesKyle Butts and John Gardner 162\nrbw: An R Package for Constructing Residual Balancing WeightsDerick S. Baum and Xiang Zhou 174\nTidy Data Neatly Resolves Mass-Spectrometry’s Ragged ArraysWilliam Kumler and Anitra E. Ingalls 193\nLog Likelihood Ratios for Common Statistical Tests Using the likelihoodR PackagePeter Cahusac 203\nCIMTx: An R Package for Causal Inference with Multiple Treatments using Observational DataLiangyuan Hu and Jiayi Ji 213\nlogitFD: an R package for functional principal component logit regressionManuel Escabias, Ana M. Aguilera and Christian Acal 231\neat: An R Package for fitting Efficiency Analysis TreesMiriam Esteve, Victor España, Juan Aparicio and Xavier Barber 249\nWill the Real Hopkins Statistic Please Stand Up?Kevin Wright 282\nMultivariate Subgaussian Stable Distributions in RBruce J. Swihart and John P. Nolan 293\nNews and Notes\nBioconductor Notes, Autumn 2022Bioconductor Core Developer Team 303\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 305\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:02+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2022-2/",
    "title": "Volume 14/2",
    "description": "Articles published in the June 2022 issue",
    "author": [],
    "date": "2022-06-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialCatherine Hurley 4\nContributed Research Articles\nbrolgar: An R package to BRowse Over Longitudinal Data Graphically and Analytically in RNicholas Tierney, Dianne Cook and Tania Prvan 6\nThe Concordance Test, an Alternative to Kruskal-Wallis Based on the Kendall-\\(\\tau\\) Distance: An R PackageJavier Alcaraz, Laura Anton-Sanchez and Juan Francisco Monge 26\nhtestClust: A Package for Marginal Inference of Clustered Data Under Informative Cluster SizeMary Gregg, Somnath Datta and Douglas Lorenz 54\nakc: A Tidy Framework for Automatic Knowledge Classification in RTian-Yuan Huang, Li Li and Liying Yang 67\nAPCI: An R and Stata Package for Visualizing and Analyzing Age-Period-Cohort DataJiahui Xu and Liying Luo 77\nshinybrms: Fitting Bayesian Regression Models Using a Graphical User Interface for the R Package brmsFrank Weber, Katja Ickstadt and Änne Glass 96\nQuantifying Population Movement Using a Novel Implementation of Digital Image Correlation in the ICvectorfields PackageDevin W. Goodsman 121\nRefreg: An R Package for Estimating Conditional Reference RegionsÓscar Lado-Baleato, Javier Roca-Pardiñas, Carmen Cadarso-Suárez and Francisco Gude 135\nTensorTest2D: Fitting Generalized Linear Models with Matrix CovariatesPing-Yang Chen, Hsing-Ming Chang, Yu-Ting Chen, Jung-Ying Tzeng and Sheng-Mao Chang 152\nwavScalogram: An R Package with Wavelet Scalogram Tools for Time Series AnalysisVicente J. Bolós and Rafael Benı́tez 164\nClusTorus: An R Package for Prediction and Clustering on the Torus by Conformal PredictionSeungki Hong and Sungkyu Jung 186\nkStatistics: Unbiased Estimates of Joint Cumulant Products from the Multivariate Faà Di Bruno’s FormulaElvira Di Nardo and Giuseppe Guarino 208\niccCounts: An R Package to Estimate the Intraclass Correlation Coefficient for Assessing Agreement with Count DataJosep L. Carrasco 229\nR-miss-tastic: a unified platform for missing values methods and workflowsImke Mayer, Aude Sportisse, Julie Josse, Nicholas Tierney and Nathalie Vialaneix 244\nAn Open-Source Implementation of the CMPS Algorithm for Assessing Similarity of BulletsWangqian Ju and Heike Hofmann 267\nrassta: Raster-Based Spatial Stratification AlgorithmsBryan A. Fuentes, Minerva J. Dorantes and John R. Tipton 286\nPDFEstimator: An R Package for Density Estimation and AnalysisJenny Farmer and Donald Jacobs 305\nreclin2: a Toolkit for Record Linkage and DeduplicationD. Jan van der Laan 320\nNews and Notes\nNews from the Bioconductor ProjectBioconductor Core Team 329\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 332\nNews from the Forwards TaskforceHeather Turner 334\nChanges in RTomas Kalibera, Sebastian Meyer and Kurt Hornik 336\nR Foundation NewsTorsten Hothorn 339\nThe Conference Report of Why R? Turkey 2022: The First R Conference with Call For Papers in TurkeyMustafa Cavus, Olgun Aydin, Ozan Evkaya, Derya Turfan, Filiz Karadag, Ozancan Ozdemir, Ugur Dar and Deniz Bezer 340\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:02+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2022-1/",
    "title": "Volume 14/1",
    "description": "Articles published in the March 2022 issue",
    "author": [],
    "date": "2022-03-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialCatherine Hurley 4\nContributed Research Articles\nA Computational Analysis of the Dynamics of R Style Based on 108 Million Lines of Code from All CRAN Packages in the Past 21 YearsChia-Yi Yen, Mia Huai-Wen Chang and Chung-hong Chan 6\nrmonad: pipelines you can compute onZebulun Arendsee, Jennifer Chang and Eve Wurtele 22\nA Software Tool For Sparse Estimation Of A General Class Of High-dimensional GLMsHassan Pazira, Luigi Augugliaro and Ernst C. Wit 34\nbayesanova: An R package for Bayesian Inference in the Analysis of Variance via Markov Chain Monte Carlo in Gaussian Mixture ModelsRiko Kelter 54\ntvReg: Time-varying Coefficients in Multi-Equation Regression in RIsabel Casas and Rubén Fernández-Casal 79\nRKHSMetaMod: An R Package to Estimate the Hoeffding Decomposition of a Complex Model by Solving RKHS Ridge Group Sparse Optimization ProblemHalaleh Kamari, Sylvie Huet and Marie-Luce Taupin 101\nMeasuring the Extent and Patterns of Urban Shrinkage for Small Towns Using RCristiana Vîlcea, Liliana Popescu and Alin Clincea 123\nblindrecalc - An R Package for Blinded Sample Size RecalculationLukas Baumann, Maximilian Pilz and Meinhard Kieser 137\nRevisiting Historical Bar Graphics on Epidemics in the Era of R ggplot2Sami Aldag, Dogukan Topcuoglu and Gul Inan 146\nspherepc: An R Package for Dimension Reduction on a SphereJongmin Lee, Jang-Hyun Kim and Hee-Seok Oh 167\nThe smoots Package in R for Semiparametric Modeling of Trend Stationary Time SeriesYuanhua Feng, Thomas Gries, Sebastian Letmathe and Dominik Schulz 182\ncpsurvsim: An R Package for Simulating Data from Change-Point Hazard DistributionsCamille J. Hochheimer, PhD and Roy T. Sabo, PhD 196\nstarvars: An R Package for Analysing Nonlinearities in Multivariate Time SeriesAndrea Bucci, Giulio Palomba and Eduardo Rossi 208\nfairmodels: a Flexible Tool for Bias Detection, Visualization, and Mitigation in Binary Classification ModelsJakub Wiśniewski and Przemysław Biecek 227\nPalmer Archipelago Penguins Data in the palmerpenguins R Package - An Alternative to Anderson’s IrisesAllison M. Horst, Alison Presmanes Hill and Kristen B. Gorman 244\nAdvancing Reproducible Research by Publishing R Markdown Notebooks as Interactive Sandboxes Using the learnr PackageChak Hau Michael Tso, Michael Hollaway, Rebecca Killick, Peter Henrys, Don Monteith, John Watkins and Gordon Blair 255\nPower and Sample Size for Longitudinal Models in R – The longpower Package and Shiny AppSamuel Iddi and Michael C Donohue 264\nPSweight: An R Package for Propensity Score Weighting AnalysisTianhui Zhou, Guangyu Tong, Fan Li, Laine E. Thomas and Fan Li 282\nRFpredInterval: An R Package for Prediction Intervals with Random Forests and Boosted ForestsCansu Alakus, Denis Larocque and Aurélie Labbe 300\netrm: Energy Trading and Risk Management in RAnders D. Sleire 320\nfcaR, Formal Concept Analysis with RPablo Cordero, Manuel Enciso, Domingo López-Rodríguez and Ángel Mora 341\nFMM: An R Package for Modeling Rhythmic Patterns in Oscillatory SystemsItziar Fernández, Alejandro Rodríguez-Collado, Yolanda Larriba, Adrián Lamela, Christian Canedo and Cristina Rueda 361\nNews and Notes\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 380\nR Foundation NewsTorsten Hothorn 382\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:02+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2021-2/",
    "title": "Volume 13/2",
    "description": "Articles published in the December 2021 issue",
    "author": [],
    "date": "2021-12-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialDianne Cook 4\nDiscussion Article\nSoftware Engineering and R Programming: A Call for ResearchMelina Vidoni 6\nWe Need Trustworthy R PackagesWilliam Michael Landau 15\nThe R Developer Community Does Have a Strong Software Engineering CultureMaëlle Salmon and Karthik Ram 18\nThe R Quest: from Users to DevelopersSimon Urbanek 22\nRejoinder: Software Engineering and R ProgrammingMelina Vidoni 25\nContributed Research Articles\ng2f as a Novel Tool to Find and Fill Gaps in Metabolic NetworksDaniel Osorio, Kelly Botero, Andrés Pinzón Velasco, Nicolás Mendoza-Mejía, Felipe Rojas- Rodríguez, George Barreto and Janneth González 28\nlg: An R package for Local Gaussian ApproximationsHåkon Otneim 38\nEstimating Social Influence Effects in Networks Using A Latent Space Adjusted Approach in RRan Xu 57\nsurvidm: An R package for Inference and Prediction in an Illness-Death ModelGustavo Soutinho, Marta Sestelo and Luís Meira-Machado 70\nMultiple Imputation and Synthetic Data Generation with NPBayesImputeCatJingchen Hu, Olanrewaju Akande and Quanli Wang 90\nmsae: An R Package of Multivariate Fay-Herriot Models for Small Area EstimationNovia Permatasari and Azka Ubaidillah 111\ncat.dt: An R package for fast construction of accurate Computerized Adaptive Tests using Decision TreesJavier Rodríguez-Cuadrado, Juan C. Laria and David Delgado-Gómez 123\nA GUIded tour of Bayesian regressionAndrés Ramírez–Hassan and Mateo Graciano-Londoño 135\nStratigrapheR: Concepts for Litholog Generation in RSébastien Wouters, Anne-Christine Da Silva, Frédéric Boulvain and Xavier Devleeschouwer 153\ndad: an R Package for Visualisation, Classification and Discrimination of Multivariate Groups Modelled by their DensitiesRachid Boumaza, Pierre Santagostini, Smail Yousfi and Sabine Demotes-Mainard 179\nNGSSEML: Non-Gaussian State Space with Exact Marginal LikelihoodThiago R. Santos, Glaura C. Franco and Dani Gamerman 208\nBayesSenMC: an R package for Bayesian Sensitivity Analysis of MisclassificationJinhui Yang, Lifeng Lin and Haitao Chu 228\nPAsso: an R Package for Assessing Partial Association between Ordinal VariablesShaobo Li, Xiaorui Zhu, Yuejie Chen and Dungang Liu 239\nbcmixed: A Package for Median Inference on Longitudinal Data with the Box–Cox TransformationKazushi Maruo, Ryota Ishii, Yusuke Yamaguchi and Masahiko Gosho 253\ndiproperm: An R Package for the DiProPerm TestAndrew G. Allmon, J.S. Marron and Michael G. Hudgens 266\nA Unifying Framework for Parallel and Distributed Processing in R using FuturesHenrik Bengtsson 273\nMatchThem:: Matching and Weighting after Multiple ImputationFarhad Pishgar, Noah Greifer, Clémence Leyrat and Elizabeth Stuart 292\nEMSS: New EM-type algorithms for the Heckman selection model in RKexuan Yang, Sang Kyu Lee, Jun Zhao and Hyoung-Moon Kim 306\nAnalysis of Corneal Data in R with the rPACI PackageDarío Ramos-López and Ana D. Maldonado 321\nMAINT.Data: Modelling and Analysing Interval Data in RA. Pedro Duarte Silva, Paula Brito, Peter Filzmoser and José G. Dias 336\nRobust and Efficient Optimization Using a Marquardt-Levenberg Algorithm with R Package marqLevAlgViviane Philipps, Boris P. Hejblum, Mélanie Prague, Daniel Commenges and Cécile Proust-Lima 365\nDRHotNet: An R package for detecting differential risk hotspots on a linear networkÁlvaro Briz-Redón, Francisco Martínez-Ruiz and Francisco Montes 380\ntramME: Mixed-Effects Transformation Models Using Template Model BuilderBálint Tamási and Torsten Hothorn 398\nmiRecSurv Package: Prentice-Williams-Peterson Models with Multiple Imputation of Unknown Number of Previous EpisodesDavid Moriña, Gilma Hernández-Herrera and Albert Navarro 419\nAn R package for Non-Normal Multivariate Distributions: Simulation and Probability Calculations from Multivariate Lomax (Pareto Type II) and Other Related DistributionsZhixin Lun and Ravindra Khattree 427\nCompModels: A Suite of Computer Model Test Functions for Bayesian OptimizationTony Pourmohamad 441\nspfilteR: An R package for Semiparametric Spatial Filtering with Eigenvectors in (Generalized) Linear ModelsSebastian Juhl 450\nSIQR: An R Package for Single-index Quantile RegressionTianhai Zu and Yan Yu 460\nmgee2: An R package for marginal analysis of longitudinal ordinal data with misclassified responses and covariatesYuliang Xu, Shuo Shuo Liu and Grace Y. Yi 471\nA New Versatile Discrete DistributionRolf Turner 485\nAutomatic Time Series Forecasting with Ata Method in R: ATAforecasting PackageAli Sabri Taylan, Güçkan Yapar and Hanife Taylan Selamlar 507\nPASSED: Calculate Power and Sample Size for Two Sample TestsJinpu Li, Ryan P. Knigge, Kaiyi Chen and Emily V. Leary 542\nspNetwork: A Package for Network Kernel Density EstimationJeremy Gelb 561\nbssm: Bayesian Inference of Non-linear and Non-Gaussian State Space Models in RJouni Helske and Matti Vihola 578\nopenSkies - Integration of Aviation Data into the R EcosystemRafael Ayala, Daniel Ayala, Lara Sellés Vidal and David Ruiz 590\nGeneralized Linear Randomized Response Modeling using GLMMRRJean-Paul Fox, Konrad Klotzke and Duco Veen 600\nVisual Diagnostics for Constrained Optimisation with Application to Guided ToursH. Sherry Zhang, Dianne Cook, Ursula Laa, Nicolas Langrené and Patricia Menéndez 624\nvolesti: Volume Approximation and Sampling for Convex Polytopes in RApostolos Chalkis and Vissarion Fisikopoulos 642\nElliptical Symmetry Tests in RSlad̄ana Babić, Christophe Ley and Marko Palangetić 661\nThe vote Package: Single Transferable Vote and Other Electoral Systems in RAdrian E. Raftery, Hana Ševčíková and Bernard W. Silverman 673\nRPESE: Risk and Performance Estimators Standard Errors with Serially Dependent DataAnthony-Alexander Christidis and R. Douglas Martin 697\nRobustBF: An R Package for Robust Solution to the Behrens-Fisher ProblemGamze Güven, Şükrü Acıtaş, Hatice Şamkar and Birdal Şenoğlu 713\nNews and Notes\nChanges in RTomas Kalibera, Sebastian Meyer, Kurt Hornik, Gennadiy Starostin and Luke Tierney 734\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 738\nR Foundation NewsTorsten Hothorn 741\nNews from the Forwards TaskforceHeather Turner 742\nNews from the Bioconductor ProjectBioconductor Core Team 744\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:01+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2021-1/",
    "title": "Volume 13/1",
    "description": "Articles published in the June 2021 issue",
    "author": [],
    "date": "2021-06-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialDianne Cook 4\nContributed Research Articles\nSEEDCCA: An Integrated R-Package for Canonical Correlation Analysis and Partial Least SquaresBo-Young Kim, Researcher, Yunju Im, Postdoctoral Associate and Jae Keun Yoo, Professor 7\nnpcure: An R Package for Nonparametric Inference in Mixture Cure ModelsAna López-Cheda, M. Amalia Jácome and Ignacio López-de-Ullibarri 21\nA Method for Deriving Information from Running R CodeMark P.J. van der Loo 42\npenPHcure: Variable Selection in Proportional Hazards Cure Model with Time-Varying CovariatesAlessandro Beretta and Cédric Heuchenne 53\nJMcmprsk: An R Package for Joint Modelling of Longitudinal and Survival Data with Competing RisksHong Wang, Ning Li, Shanpeng Li and Gang Li* 67\nexPrior: An R Package for the Formulation of Ex-Situ PriorsFalk Heße, Karina Cucchi, Nura Kawa and Yoram Rubin 83\nWide-to-tall Data Reshaping Using Regular Expressions and the nc PackageToby Dylan Hocking 98\nUnidimensional and Multidimensional Methods for Recurrence Quantification Analysis with crqaMoreno I. Coco, Dan Mønster, Giuseppe Leonardi, Rick Dale and Sebastian Wallot 112\nThe bdpar Package: Big Data Pipelining Architecture for RMiguel Ferreiro-Díaz, Tomás R. Cotos-Yáñez, José R. Méndez and David Ruano-Ordás 131\nLinear Regression with Stationary Errors: the R Package slmEmmanuel Caron, Jérôme Dedecker and Bertrand Michel 146\nclustcurv: An R Package for Determining Groups in Multiple CurvesNora M. Villanueva, Marta Sestelo, Luís Meira-Machado and Javier Roca-Pardiñas 164\nBenchmarking R packages for Calculation of Persistent HomologyEashwar V. Somasundaram, Shael E. Brown, Adam Litzler, Jacob G. Scott and Raoul R. Wadhwa 184\nStatistical Quality Control with the qcr PackageMiguel Flores, Rubén Fernández-Casal, Salvador Naya and Javier Tarrío-Saavedra 194\npdynmc: A Package for Estimating Linear Dynamic Panel Data Models Based on Nonlinear Moment ConditionsMarkus Fritsch, Andrew Adrian Yu Pua and Joachim Schnurbus 218\nDChaos: An R Package for Chaotic Time Series AnalysisJulio E. Sandubete and Lorenzo Escot 232\nIndexNumber: An R Package for Measuring the Evolution of MagnitudesAlejandro Saavedra-Nieves and Paula Saavedra-Nieves 253\nROBustness In Network (robin): an R Package for Comparison and Validation of CommunitiesValeria Policastro (package author and creator), Dario Righelli, Annamaria Carissimo, Luisa Cutillo and Italia De Feis 276\nFinding Optimal Normalizing Transformations via bestNormalizeRyan A. Peterson 294\nPackage wsbackfit for Smooth Backfitting Estimation of Generalized Structured ModelsJavier Roca-Pardiñas, María Xosé Rodríguez-Álvarez and Stefan Sperlich 314\ngarchx: Flexible and Robust GARCH-X ModelingGenaro Sucarrat 335\nRLumCarlo: Simulating Cold Light using Monte Carlo MethodsSebastian Kreutzer, Johannes Friedrich, Vasilis Pagonis, Christian Laag, Ena Rajovic and Christoph Schmidt 351\nThe R Package smicd: Statistical Methods for Interval-Censored DataPaul Walter 366\nOneStep : Le Cam’s One-step Estimation ProcedureAlexandre Brouste, Christophe Dutang and Darel Noutsa Mieniedou 383\nThe HBV.IANIGLA Hydrological ModelEzequiel Toum, Mariano H. Masiokas, Ricardo Villalba, Pierre Pitte and Lucas Ruiz 395\nkrippendorffsalpha: An R Package for Measuring Agreement Using Krippendorff’s Alpha CoefficientJohn Hughes 413\nWorking with CRSP/COMPUSTAT in R: Reproducible Empirical Asset PricingMajeed Simaan 426\nAnalyzing Dependence between Point Processes in Time Using IndTestPPAna C. Cebrián and Jesús Asín 444\nConversations in Time: Interactive Visualization to Explore Structured Temporal DataEaro Wang and Dianne Cook 461\ndistr6: R6 Object-Oriented Probability Distributions Interface in RRaphael Sonabend and Franz J. Király 470\ngofCopula: Goodness-of-Fit Tests for CopulaeOstap Okhrin, Simon Trimborn and Martin Waltz 493\nROCnReg: An R Package for Receiver Operating Characteristic Curve Inference With and Without CovariatesMaría Xosé Rodríguez-Álvarez and Vanda Inácio 525\nAutomating Reproducible, Collaborative Clinical Trial Document Generation with the listdown PackageMichael Kane, Xun Jiang and Simon Urbanek 556\nTowards a Grammar for Processing Clinical Trial DataMichael J. Kane 563\nReproducible Summary Tables with the gtsummary PackageDaniel D. Sjoberg, Karissa Whiting, Michael Curry, Jessica A. Lavery and Joseph Larmarange 570\nRegularized Transformation Models: The tramnet PackageLucas Kook, Torsten Hothorn 581\nBayesSPsurv: An R Package to Estimate Bayesian (Spatial) Split-Population Survival ModelsBrandon Bolte, Nicolás Schmidt, Sergio Béjar, Nguyen Huynh and Bumba Mukherjee 595\nstratamatch: Prognostic Score Stratification Using a Pilot DesignRachael C. Aikens, Joseph Rigdon, Justin Lee, Michael Baiocchi, Andrew B. Goldstone, Peter Chiu, Y. Joseph Woo and Jonathan H. Chen 614\nNews and Notes\nNews from the Bioconductor ProjectBioconductor Core Team 631\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 633\nNews from the Forwards TaskforceHeather Turner 636\nChanges in R 4.0–4.1Tomas Kalibera, Sebastian Meyer and Kurt Hornik 638\nR Foundation NewsTorsten Hothorn 641\nR Medicine 2020: The Power of Going VirtualElizabeth J. Atkinson, Peter D. Higgins, Denise Esserman, Michael J. Kane, Steven J. Schwager, Joseph B. Rickert, Daniella Mark, Mara Alexeev and Stephan Kadauke 642\nConference Report of Why R? Turkey 2021Mustafa Cavus, Olgun Aydın, Ozan Evkaya, Ozancan Ozdemir, Deniz Bezer and Ugur Dar 648\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:01+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2020-2/",
    "title": "Volume 12/2",
    "description": "Articles published in the December 2020 issue",
    "author": [],
    "date": "2020-12-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialMichael J. Kane 4\nContributed Research Articles\nThe biglasso Package: A Memory- and Computation-Efficient Solver for Lasso Model Fitting with Big Data in RYaohui Zeng and Patrick Breheny 6\nSix Years of Shiny in Research - Collaborative Development of Web Tools in RPeter Kasprzak, Lachlan Mitchell, Olena Kravchuk and Andy Timmins 20\nA Fast and Scalable Implementation Method for Competing Risks Data with the R Package fastcmprskEric S. Kawaguchi, Jenny I. Shen, Gang Li and Marc A. Suchard 43\nordinalClust: An R Package to Analyze Ordinal DataMargot Selosse, Julien Jacques and Christophe Biernacki 61\nKSPM: A Package For Kernel Semi-Parametric ModelsCatherine Schramm, Sébastien Jacquemont, Karim Oualkacha, Aurélie Labbe and Celia M.T. Greenwood 82\nComparing Multiple Survival Functions with Crossing Hazards in RHsin-wen Chang, Pei-Yuan Tsai, Jen-Tse Kao and Guo-You Lan 107\nA Unified Algorithm for the Non-Convex Penalized Estimation: The ncpen PackageDongshin Kim, Sangin Lee and Sunghoon Kwon 120\nTULIP: A Toolbox for Linear Discriminant Analysis with PenaltiesYuqing Pan, Qing Mai and Xin Zhang 134\nfitzRoy - An R Package to Encourage Reproducible Sports AnalysisRobert N. Nguyen, James T. Day, David I. Warton and Oscar Lane 155\nAssembling Pharmacometric Datasets in R - The puzzle PackageMario González Sales*, Olivier Barrière*, Pierre Olivier Tremblay, Guillaume Bonnefois, Julie Desrochers and Fahima Nekka 163\nRNGforGPD: An R Package for Generation of Univariate and Multivariate Generalized Poisson DataHesen Li, Dr. Hakan Demirtas and Ruizhe Chen 173\nTesting the Equality of Normal Distributed and Independent Groups’ Means Under Unequal Variances by doex PackageMustafa Cavus and Berna Yazıcı 189\nAQuadtree: an R Package for Quadtree Anonymization of Point DataRaymond Lagonigro, Ramon Oller and Joan Carles Martori 209\nmiWQS: Multiple Imputation Using Weighted Quantile Sum RegressionPaul M. Hargarten and David C. Wheeler 226\nUser-Specified General-to-Specific and Indicator Saturation MethodsGenaro Sucarrat 251\nKuhn-Tucker and Multiple Discrete-Continuous Extreme Value Model Estimation and Simulation in R: The rmdcev PackagePatrick Lloyd-Smith 266\nNTS: An R Package for Nonlinear Time Series AnalysisXialu Liu, Rong Chen and Ruey Tsay 293\nSpecies Distribution Modeling using Spatial Point Processes: a Case Study of Sloth Occurrence in Costa RicaPaula Moraga 311\nA Graphical EDA Tool with ggplot2: brintonPere Millán-Martínez and Ramon Oller 322\nMoTBFs: An R Package for Learning Hybrid Bayesian Networks Using Mixtures of Truncated Basis FunctionsInmaculada Pérez-Bernabé, Ana D. Maldonado, Thomas D. Nielsen and Antonio Salmerón 342\nAnalyzing Basket Trials under Multisource Exchangeability AssumptionsMichael J. Kane 359\nOpenLand: Software for Quantitative Analysis and Visualization of Land Use and Cover ChangeReginal Exavier and Peter Zeilhofer 372\nFarmTest: An R Package for Factor-Adjusted Robust Multiple TestingKoushiki Bose, Jianqing Fan, Yuan Ke and Xiaoou Pan, Wen-Xin Zhou 388\nNews and Notes\nChanges in R 3.6–4.0Tomas Kalibera, Sebastian Meyer and Kurt Hornik 402\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 407\nNews from the Bioconductor ProjectBioconductor Core Team 410\nR Foundation NewsTorsten Hothorn 411\nNews from the Forwards TaskforceHeather Turner 413\ne-Rum2020: how we turned a physical conference into a successful virtual eventMariachiara Fortuna, Francesca Vitalini, Mirko Signorelli, Emanuela Furfaro, Federico Marini, Gert Janssenswillen’, Riccardo Porreca, Riccardo L. Rossi, Andrea Guzzo, Roberta Sirovich and Andrea 416\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:01+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2020-1/",
    "title": "Volume 12/1",
    "description": "Articles published in the June 2020 issue",
    "author": [],
    "date": "2020-06-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nEditorialMichael J. Kane 4\nContributed Research Articles\ngk: An R Package for the g-and-k and Generalised g-and-h DistributionsDennis Prangle 7\nNlinTS: An R Package For Causality Detection in Time SeriesYoussef Hmamouche 21\nMapping Smoothed Spatial Effect Estimates from Individual-Level Data: MapGAMLu Bai, Daniel L. Gillen, Scott M. Bartell and Verónica M. Vieira 32\nmudfold: An R Package for Nonparametric IRT Modelling of Unfolding ProcessesSpyros E. Balafas, Wim P. Krijnen, Wendy J. Post and Ernst C. Wit 49\ntsmp: An R Package for Time Series with Matrix ProfileFrancisco Bischoff and Pedro Pereira Rodrigues 76\nIndividual-Level Modelling of Infectious Disease Data: EpiILMVineetha Warriyar K. V., Waleed Almutiry and Rob Deardon 87\nSurvBoost: An R Package for High-Dimensional Variable Selection in the Stratified Proportional Hazards Model via Gradient BoostingEmily Morris, Kevin He, Yanming Li, Yi Li and Jian Kang 105\nCoxPhLb: An R Package for Analyzing Length Biased Data under Cox ModelChi Hyun Lee, Heng Zhou, Jing Ning, Diane D. Liu and Yu Shen 118\nSortedEffects: Sorted Causal Effects in RShuowen Chen, Victor Chernozhukov, Iván Fernández-Val and Ye Luo 131\nnpordtests: An R Package of Nonparametric Tests for Equality of Location Against Ordered AlternativesBulent Altunkaynak and Hamza Gamgam 147\nlspartition: Partitioning-Based Least Squares RegressionMatias D. Cattaneo, Max H. Farrell and Yingjie Feng 172\nSkew-t Expected Information Matrix Evaluation and Use for Standard Error CalculationsR. Douglas Martin, Chindhanai Uthaisaad and Daniel Z. Xia 188\nrcosmo: R Package for Analysis of Spherical, HEALPix and Cosmological DataDaniel Fryer, Ming Li and Andriy Olenko 206\nTools for Analyzing R Code the Tidy WayLucy D’Agostino McGowan, Sean Kross and Jeffrey Leek 226\nspinifex: An R Package for Creating a Manual Tour of Low-dimensional Projections of Multivariate DataNicholas Spyrison and Dianne Cook 243\nari: The Automated R InstructorSean Kross, Jeffrey T. Leek and John Muschelli 258\nCopulaCenR: Copula based Regression Models for Bivariate Censored Data in RTao Sun and Ying Ding 266\nmistr: A Computational Framework for Mixture and Composite DistributionsLukas Sablica and Kurt Hornik 283\ndifNLR: Generalized Logistic Regression Models for DIF and DDF DetectionAdéla Hladká and Patrícia Martinková 300\nBayesMallows: An R Package for the Bayesian Mallows ModelØystein Sørensen, Marta Crispino, Qinghua Liu and Valeria Vitelli 324\nVariable Importance Plots—An Introduction to the vip PackageBrandon M. Greenwell and Bradley C. Boehmke 343\nSimilaR: R Code Clone and Plagiarism DetectionMaciej Bartoszuk and Marek Gagolewski 367\nLinear Fractional Stable Motion with the rlfsm R PackageStepan Mazur and Dmitry Otryakhin 386\nThe R package NonProbEst for estimation in non-probability surveysM. Rueda, R. Ferri-García and L. Castro 406\nProjectManagement: an R Package for Managing ProjectsJuan Carlos Gonçalves-Dosantos, Ignacio García-Jurado and Julián Costa 419\nThe Rockerverse: Packages and Applications for Containerisation with RDaniel Nüst, Dirk Eddelbuettel, Dom Bennett, Robrecht Cannoodt, Dav Clark, Gergely Daróczi, Mark Edmondson, Colin Fay, Ellis Hughes, Lars Kjeldgaard, Sean Lopp, Ben Marwick, Heather Nolis, Jacqueline Nolis, Hong Ooi, Karthik Ram, Noam Ross, Lori Shepherd, Péter Sólymos, Tyson Lee Swetnam, Nitesh Turaga, Charlotte Van Petegem, Jason Williams, Craig Willis and Nan Xiao 437\nSpecial Articles\nS, R, and Data ScienceJohn M. Chambers 462\nProvenance of R’s Gradient OptimizersJohn C. Nash 477\nNews and Notes\nConference Report: Why R? 2019Michał Burdukiewicz, Filip Pietluch, Jarosław Chilimoniuk, Katarzyna Sidorczuk, Dominik Rafacz, Leon Eyrich Jessen, Stefan Rödiger, Marcin Kosin ́ski and Piotr Wójcik 484\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 485\nR Foundation NewsTorsten Hothorn 498\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:01+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2019-2/",
    "title": "Volume 11/2",
    "description": "Articles published in the Dec. 2019 issue",
    "author": [],
    "date": "2019-12-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nEditorialMichael J. Kane 4\nContributed Research Articles\nUsing Web Services to Work with Geodata in RJan-Philipp Kolb 6\northoDr: Semiparametric Dimension Reduction via Orthogonality Constrained OptimizationRuoqing Zhu, Jiyang Zhang, Ruilin Zhao, Peng Xu, Wenzhuo Zhou and Xin Zhang 24\ncoxed: An R Package for Computing Duration-Based Quantities from the Cox Proportional Hazards ModelJonathan Kropko and Jeffrey J. Harden 38\nModeling regimes with extremes: the bayesdfa package for identifying and forecasting common trends and anomalies in multivariate time-series dataEric J. Ward, Sean C. Anderson, Luis A. Damiano, Mary E. Hunsicker and Michael A. Litzow 46\nFitting Tails by the Empirical Residual Coefficient of Variation: The ercv PackageJoan del Castillo, Isabel Serra, Maria Padilla and David Moriña 56\nbiclustermd: An R Package for Biclustering with Missing ValuesJohn Reisner, Hieu Pham, Sigurdur Olafsson, Stephen Vardeman and Jing Li 69\nauditor: an R Package for Model-Agnostic Visual Validation and DiagnosticsAlicja Gosiewska and Przemysław Biecek 85\nThe R Package trafo for Transforming Linear Regression ModelsLily Medina, Ann-Kristin Kreutzmann, Natalia Rojas-Perilla and Piedad Castro 99\nBondValuation: An R Package for Fixed Coupon Bond AnalysisWadim Djatschenko 124\nConvergenceClubs: A Package for Performing the Phillips and Sul’s Club Convergence Clustering ProcedureRoberto Sichera and Pietro Pizzuto 142\nPPCI: an R Package for Cluster Identification using Projection PursuitDavid P. Hofmeyr and Nicos G. Pavlidis 152\ndr4pl: A Stable Convergence Algorithm for the 4 Parameter Logistic ModelHyowon An, Justin T. Landis, Aubrey G. Bailey, James S. Marron and Dirk P. Dittmer 171\ncvcrand: A Package for Covariate-constrained Randomization and the Clustered Permutation Test for Cluster Randomized TrialsHengshi Yu, Fan Li, John A. Gallis and Elizabeth L. Turner 191\njomo: A Flexible Package for Two-level Joint Modelling Multiple ImputationMatteo Quartagno, Simon Grund and James Carpenter 205\nTime Series Forecasting with KNN in R: the tsfknn PackageFrancisco Martínez, María P. Frías, Francisco Charte and Antonio J. Rivera 229\nrollmatch: An R Package for Rolling Entry MatchingKasey Jones, Rob Chew, Allison Witman and Yiyan Liu 243\nAssociative Classification in R: arc, arulesCBA, and rCBAMichael Hahsler, Ian Johnson, Tomáš Kliegr and Jaroslav Kuchař 254\nroahd Package: Robust Analysis of High Dimensional DataFrancesca Ieva, Anna Maria Paganoni, Juan Romo and Nicholas Tarabelloni 291\nThe IDSpatialStats R Package: Quantifying Spatial Dependence of Infectious Disease SpreadJohn R. Giles, Henrik Salje and Justin Lessler 308\nComparing namedCapture with other R packages for regular expressionsToby Dylan Hocking 328\nThe Landscape of R Packages for Automated Exploratory Data AnalysisMateusz Staniak and Przemysław Biecek 347\nHCmodelSets: An R Package for Specifying Sets of Well-fitting Models in High DimensionsHenrique Hoeltgebaum and Heather Battey 370\nResampling-Based Analysis of Multivariate Data and Repeated Measures Designs with the R Package MANOVA.RMSarah Friedrich, Frank Konietschke and Markus Pauly 380\nspGARCH: An R-Package for Spatial and Spatiotemporal ARCH and GARCH modelsPhilipp Otto 401\nlpirfs: An R Package to Estimate Impulse Response Functions by Local ProjectionsPhilipp Adämmer 421\nNews and Notes\nConference: Report ConectaR 2019Marcela Alfaro Córdoba, Frans van Dunné, Agustín Gómez Meléndez and Jacob van Etten 439\nR Foundation NewsTorsten Hothorn 443\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 444\nNews from the Bioconductor ProjectBioconductor Core Team 447\nR NewsR Core Team 448\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:01+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2019-1/",
    "title": "Volume 11/1",
    "description": "Articles published in the June 2019 issue",
    "author": [],
    "date": "2019-06-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nEditorialNorm Matloff 4\nContributed Research Articles\natable: Create Tables for Clinical Trial ReportsArmin Ströbel 137\nConnecting R with D3 for dynamic graphics, to explore multivariate data with toursMichael Kipp, Ursula Laa and Dianne Cook 245\nOptimization Routines for Enforcing One-to-One Matches in Record Linkage ProblemsDiego Moretti, Luca Valentino and Tiziana Tuoto 185\nmixedsde: A Package to Fit Mixed Stochastic Differential EquationsCharlotte Dion, Simone Hermann and Adeline Samson 44\nIndoor Positioning and Fingerprinting: The R Package ipftEmilio Sansano, Raúl Montoliu, Óscar Belmonte and Joaquín Torres-Sospedra 67\nRobustGaSP: Robust Gaussian Stochastic Process Emulation in RMengyang Gu, Jesus Palomo and James O. Berger 112\nWhats for dynr: A Package for Linear and Nonlinear Dynamic Modeling in RLu Ou, Michael D. Hunter and Sy-Miin Chow 91\nIdentifying and Testing Recursive vs. Interdependent Links in Simultaneous Equation Models via the SIRE PackageGianmarco Vacca and Maria Grazia Zoia 149\nfclust: An R Package for Fuzzy ClusteringMaria Brigida Ferraro, Paolo Giordani and Alessio Serafini 198\nMatching with Clustered Data: the CMatching Package in RMassimo Cannas and Bruno Arpino 7\nMDFS: MultiDimensional Feature Selection in RRadosław Piliszek, Krzysztof Mnich, Szymon Migacz, Paweł Tabaszewski, Andrzej Sułecki, Aneta Polewko-Klim and Witold Rudnicki 198\nNowcasting: An R Package for Predicting Economic Variables Using Dynamic Factor ModelsSerge de Valk, Daiane de Mattos and Pedro Ferreira 230\nSimCorrMix: Simulation of Correlated Data with Multiple Variable Types Including Continuous and Count Mixture DistributionsAllison Fialkowski and Hemant Tiwari 250\nTime-Series Clustering in R Using the dtwclust PackageAlexis Sardá-Espinosa 22\nshadow: R Package for Geometric Shadow Calculations in an Urban EnvironmentMichael Dorman, Evyatar Erell, Adi Vulkan and Itai Kloog 287\nIntegration of networks and pathways with StarBioTrek packageClaudia Cava and Isabella Castiglioni 310\nciuupi: An R package for Computing Confidence Intervals that Utilize Uncertain Prior InformationRheanna Mainzer and Paul Kabaila 323\nipwErrorY: An R Package for Estimation of Average Treatment Effect with Misclassified Binary OutcomeDi Shu and Grace Y. Yi 337\noptimParallel: An R Package Providing a Parallel Version of the L-BFGS-B Optimization MethodFlorian Gerber and Reinhard Furrer 352\nswgee: An R Package for Analyzing Longitudinal Data with Response Missingness and Covariate Measurement ErrorJuan Xiong and Grace Y. Yi 416\nBINCOR: An R package for Estimating the Correlation between Two Unevenly Spaced Time SeriesJosue M. Polanco-Martinez, Martin A. Medina-Elizalde, Maria Fernanda Sanchez Goni and Manfred Mudelsee 170\nFixed Point Acceleration in RStuart Baumann and Margaryta Klymak 359\nSemiCompRisks: An R Package for the Analysis of Independent and Cluster-correlated Semi-competing Risks DataDanilo Alvares, Sebastien Haneuse, Catherine Lee and Kyu Ha Lee 376\nRSSampling: A Pioneering Package for Ranked Set SamplingBusra Sevinc, Bekir Cetintav, Melek Esemen and Selma Gurler 401\nunival: An FA-based R Package For Assessing Essential Unidimensionality Using External Validity InformationPere J. Ferrando, Urbano Lorenzo-Seva and David Navarro-Gonzalez 427\nNews and Notes\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 438\nR NewsR Core Team 442\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:01+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2018-2/",
    "title": "Volume 10/2",
    "description": "Articles published in the Dec. 2018 issue",
    "author": [],
    "date": "2018-12-01",
    "categories": [],
    "contents": "\n\n\nComplete issue\n\n\n\nTable of contents\n\nEditorialJohn\nVerzani 4\nContributed Research\nArticles\nstplanr: A Package for Transport\nPlanningRobin Lovelace and Richard Ellison 7\nThe utiml Package: Multi-label\nClassification in RAdriano Rivolli and Andre C. P. L. F. de\nCarvalho 24\nrcss: R package for optimal\nconvex stochastic switchingJuri Hinz and Jeremy Yee 38\nnsROC: An R package for\nNon-Standard ROC Curve AnalysisSonia Pérez-Fernández, Pablo\nMartínez-Camblor, Peter Filzmoser and Norberto Corral 55\naddhaz: Contribution of Chronic\nDiseases to the Disability Burden Using RRenata Tiene de\nCarvalho Yokota, Caspar WN Looman, Wilma Johanna Nusselder, Herman Van\nOyen and Geert Molenberghs 75\nSnowboot: Bootstrap Methods for\nNetwork InferenceYuzhou Chen, Yulia R. Gel, Vyacheslav Lyubchich\nand Kusha Nezafati 95\nrevengc: An R package to Reverse\nEngineer Summarized DataSamantha Duchscherer, Robert Stewart and\nMarie Urban 114\nBasis-Adaptive Selection\nAlgorithm in dr-packageJae Keun Yoo 124\nSARIMA Analysis and Automated\nModel Reports with BETS, an R PackageTalitha F. Speranza, Pedro\nC. Ferreira and Jonatha A. da Costa 133\nfICA: FastICA Algorithms and\nTheir Improved VariantsJari Miettinen, Klaus Nordhausen and Sara\nTaskinen 148\nProfile Likelihood Estimation of\nthe Correlation Coefficient in the Presence of Left, Right or Interval\nCensoring and Missing DataYanming Li, Brenda W. Gillespie, Kerby\nShedden and John A. Gillespie 159\nSpatial Uncertainty Propagation\nAnalysis with the spup R PackageKasia Sawicka, Gerard B.M.\nHeuvelink and Dennis J.J. Walvoort 180\nclustMixType: User-Friendly\nClustering of Mixed-Type Data in RGero Szepannek 200\nStilt: Easy Emulation of Time\nSeries AR(1) Computer Model Output in Multidimensional Parameter\nSpaceRoman Olson, Kelsey L. Ruckert, Won Chang, Klaus Keller,\nMurali Haran and Soon-Il An 209\nSMM: An R Package for Estimation\nand Simulation of Discrete-time semi-Markov ModelsVlad Stefan\nBarbu, Caroline Bérard, Dominique Cellier, Mathilde Sautreuil and\nNicolas Vergne 226\nggplot2 Compatible\nQuantile-Quantile Plots in RAlexandre Almeida, Adam Loy and\nHeike Hofmann 248\nForecast Combinations in R using\nthe ForecastComb PackageChristoph E. Weiss, Eran Raviv and\nGernot Roetzer 262\ntestforDEP: An R Package for\nModern Distribution-free Tests and Visualization Tools for\nIndependenceJeffrey C. Miecznikowski, En-shuo Hsu, Yanhua Chen\nand Albert Vexler 282\nrFSA: An R Package for Finding\nBest Subsets and InteractionsJoshua Lambert, Liyu Gong, Corrine\nF. Elliott, Katherine Thompson and Arnold Stromberg 295\nDot-Pipe: an S3 Extensible Pipe\nfor RJohn Mount and Nina Zumel 309\nidmTPreg: Regression Model for\nProgressive Illness Death DataLeyla Azarang and Manuel Oviedo de\nla Fuente 317\nlmridge: A Comprehensive R\nPackage for Ridge RegressionMuhammad Imdad Ullah, Muhammad Aslam\nand Saima Altaf 326\nGeospatial Point\nDensityPaul F. Evangelista and David Beskow 347\nConsistency Cubes: a fast,\nefficient method for exact Boolean minimization.Adrian Dusa\n357\nsdpt3r: Semidefinite Quadratic\nLinear Programming in RAdam Rahman 371\nExplanations of Model\nPredictions with live and breakDown PackagesMateusz Staniak and\nPrzemysław Biecek 395\nDownside Risk Evaluation with\nthe R Package GASDavid Ardia, Kris Boudt and Leopoldo Catania\n410\nNetworkToolbox: Methods and\nMeasures for Brain, Cognitive, and Psychometric Network Analysis in\nRAlexander P. Christensen 422\njsr223: A Java Platform\nIntegration for R with Programming Languages Groovy, JavaScript, JRuby,\nJython, and KotlinFloid R. Gilbert and David B. Dahl 440\nbnclassify: Learning Bayesian\nNetwork ClassifiersBojan Mihaljević, Concha Bielza and Pedro\nLarrañaga 455\nDynamic Simulation and Testing\nfor Single-Equation Cointegrating and Stationary Autoregressive\nDistributed Lag ModelsSoren Jordan and Andrew Q. Philips 469\nThe politeness Package:\nDetecting Politeness in Natural LanguageMichael Yeomans,\nAlejandro Kantor and Dustin Tingley 489\nShinyItemAnalysis for Teaching\nPsychometrics and to Enforce Routine Analysis of Educational\nTestsPatrícia Martinková and Adéla Drabinová 503\nRcppMsgPack: MessagePack Headers\nand Interface Functions for RTravers Ching and Dirk Eddelbuettel\n516\nBNSP: an R Package for Fitting\nBayesian Semiparametric Regression Models and Variable\nSelectionGeorgios Papageorgiou 526\nMeasurement Errors in\nRIñaki Ucar, Edzer Pebesma and Arturo Azcorra 549\nNavigating the R Package\nUniverseJulia Silge, John C. Nash and Spencer Graves 558\nNews and Notes\nConference Report: LatinR\n2018Laura Acion, Natalia da Silva and Riva Quiroga 564\nConference Report: SER\nIIIAriel Levy, Luciane F. Alcoforado and Orlando Celso Longo\n567\nConference Report: Why R?\n2018Michał Burdukiewicz, Marta Karas, Leon Eyrich Jessen, Marcin\nKosiński, Bernd Bischl and Stefan Rödiger 572\nConference Report: R / Pharma\n2018Joseph Rickert 579\nConference Report: R /\nMedicine ReportJoseph Rickert, Naras Balasubramanian and Michael\nKane 581\nR Foundation\nNewsTorsten Hothorn 583\nChanges on CRANKurt\nHornik, Uwe Ligges and Achim Zeileis 584\nNews from the Bioconductor\nProjectBioconductor Core Team 587\nChanges in RR Core Team\n588\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:01+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2018-1/",
    "title": "Volume 10/1",
    "description": "Articles published in the Jul 2018 issue",
    "author": [],
    "date": "2018-06-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nEditorialJohn Verzani 4\nContributed Research Articles\nA System for an Accountable Data Analysis Process in RJonathan Gelfond, Martin Goros, Brian Hernandez and Alex Bokov 6\nRealVAMS: An R Package for Fitting a Multivariate Value-added Model (VAM)Jennifer Broatch, Jennifer Green and Andrew Karl 22\nInfoTrad: An R package for estimating the probability of informed tradingDuygu Çelik and Murat Tiniç 31\nRatingScaleReduction package: stepwise rating scale item reduction without predictability lossWaldemar W. Koczkodaj, Feng Li and Alicja Wolny–Dominiak 43\nmmpf: Monte-Carlo Methods for Prediction FunctionsZachary M. Jones 56\nGeneralized Additive Model Multiple Imputation by Chained Equations With Package ImputeRobustDaniel Salfran and Martin Spiess 61\nMGLM: An R Package for Multivariate Categorical Data AnalysisJuhyun Kim, Yiwen Zhang, Joshua Day and Hua Zhou 73\nArCo: An R package to Estimate Artificial CounterfactualsYuri R. Fonseca, Ricardo P. Masini, Marcelo C. Medeiros and Gabriel F. R. Vasconcelos 91\nPanJen: An R package for Ranking Transformations in a Linear RegressionCathrine Ulla Jensen and Toke Emil Panduro 109\nTackling Uncertainties of Species Distribution Model Projections with Package mopaM. Iturbide, J. Bedia and J.M. Gutiérrez 122\nFHDI: An R Package for Fractional Hot Deck ImputationJongho Im, In Ho Cho and Jae Kwang Kim 140\nBayesian Testing, Variable Selection and Model Averaging in Linear Models using R with BayesVarSelGonzalo Garcia-Donato and Anabel Forte 155\nonewaytests: An R Package for One-Way Tests in Independent Groups DesignsOsman Dag, Anil Dolgun and Naime Meric Konar 175\nInventorymodel: an R Package for Centralized Inventory ProblemsAlejandro Saavedra-Nieves 200\nR Package imputeTestbench to Compare Imputation Methods for Univariate Time SeriesMarcus W Beck, Neeraj Bokde, Gualberto Asencio-Cortés and Kishore Kulat 218\nICSOutlier: Unsupervised Outlier Detection for Low-Dimensional Contamination StructureAurore Archimbaud, Klaus Nordhausen and Anne Ruiz-Gazen 234\nrpostgis: Linking R with a PostGIS Spatial DatabaseDavid Bucklin and Mathieu Basille 251\nlba: An R Package for Latent Budget AnalysisEnio G. Jelihovschi and Ivan Bezerra Allaman 269\nSemiparametric Generalized Linear Models with the gldrm PackageMichael J. Wurm and Paul J. Rathouz 288\nLP Algorithms for Portfolio Optimization: The PortfolioOptim PackageAndrzej Palczewski 308\nWelfare, Inequality and Poverty Analysis with rtip: An Approach Based on Stochastic DominanceAngel Berihuete, Carmen D. Ramos and Miguel A. Sordo 328\ndimRed and coRanking - Unifying Dimensionality Reduction in RGuido Kraemer, Markus Reichstein and Miguel D. Mahecha 342\nGrpString: An R Package for Analysis of Groups of StringsHui Tang, Elizabeth L. Day, Molly B. Atkinson and Norbert J. Pienta 359\nEpistemic Game Theory: Putting Algorithms to WorkBilge Başer and Nalan Cinemre 370\nResiduals and Diagnostics for Binary and Ordinal Regression Models: An Introduction to the sure PackageBrandon M. Greenwell, Andrew J. McCarthy, Bradley C. Boehmke and Dungang Liu 381\nAdvanced Bayesian Multilevel Modeling with the R Package brmsPaul-Christian Bürkner 395\nSupport Vector Machines for Survival Analysis with RCésaire J. K. Fouodo, Inke R. König, Claus Weihs, Andreas Ziegler and Marvin N. Wright 412\nNonparametric Independence Tests and k-sample Tests for Large Sample Sizes Using Package HHGBarak Brill, Yair Heller and Ruth Heller 424\nSimple Features for R: Standardized Support for Spatial Vector DataEdzer Pebesma 439\nPstat: An R Package to Assess Population Differentiation in Phenotypic TraitsStéphane Blondeau Da Silva and Anne Da Silva 447\nCollections in R: Review and ProposalTimothy Barry 455\nApproximating the Sum of Independent Non-Identical Binomial Random VariablesBoxiang Liu and Thomas Quertermous 472\ncchs: An R Package for Stratified Case-Cohort StudiesEdmund Jones 484\nSmall Area Disease Risk Estimation and Visualization Using RPaula Moraga 495\nSetMethods: an Add-on R Package for Advanced QCAIoana-Elena Oana and Carsten Q. Schneider 507\nHRM: An R Package for Analysing High-dimensional Multi-factor Repeated MeasuresMartin Happ, Solomon W. Harrar and Arne C. Bathke 534\nNews and Notes\nConference Report: eRum 2018Gergely Daróczi 549\nR Day reportFernando P. Mayer, Walmes M. Zeviani, Wagner H. Bonat, Elias T. Krainski and Paulo J. Ribeiro Jr About 551\nR Foundation NewsTorsten Hothorn 555\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 556\nNews from the Bioconductor ProjectBioconductor Core Team 560\nChanges in RR Core Team 561\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:01+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2017-2/",
    "title": "Volume 9/2",
    "description": "Articles published in the Dec. 2017 issue",
    "author": [],
    "date": "2017-12-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nEditorialRoger Bivand 4\nContributed Research Articles\nanchoredDistr: a Package for the Bayesian Inversion of Geostatistical Parameters with Multi-type and Multi-scale DataHeather Savoy, Falk Heße and Yoram Rubin 6\ndGAselID: An R Package for Selecting a Variable Number of Features in High Dimensional DataNicolae Teodor Melita and Stefan Holban 18\nAllele Imputation and Haplotype Determination from Databases Composed of Nuclear FamiliesNathan Medina-Rodríguez and Ángelo Santana 35\nVisualization of Regression Models Using visregPatrick Breheny and Woodrow Burchett 56\nfourierin: An R package to compute Fourier integralsGuillermo Basulto-Elias, Alicia Carriquiry, Kris De Brabanter and Daniel J. Nordman 72\nDiscrete Time Markov Chains with RGiorgio Alfredo Spedicato 84\nCRTgeeDR: an R Package for Doubly Robust Generalized Estimating Equations Estimations in Cluster Randomized Trials with Missing DataMelanie Prague, Rui Wang and Victor De Gruttola 105\nqueueing: A Package For Analysis Of Queueing Networks and Models in RPedro Cañadilla Jiménez and Yolanda Román Montoya 116\nctmcd: An R Package for Estimating the Parameters of a Continuous-Time Markov Chain from Discrete-Time DataMarius Pfeuffer 127\nFurniture for Quantitative ScientistsTyson S. Barrett and Emily Brignone 142\nBayesBD: An R Package for Bayesian Inference on Image BoundariesNicholas Syring and Meng Li 149\narulesViz: Interactive Visualization of Association Rules with RMichael Hahsler 163\nManlyMix: An R Package for Manly Mixture ModelingXuwen Zhu and Volodymyr Melnykov 176\nadegraphics: An S4 Lattice-Based Package for the Representation of Multivariate DataAurélie Siberchicot, Alice Julien-Laferrière, Anne-Béatrice Dufour, Jean Thioulouse and Stéphane Dray 198\ncarx: an R Package to Estimate Censored Autoregressive Time Series with Exogenous CovariatesChao Wang and Kung-Sik Chan 213\nliureg: A Comprehensive R Package for the Liu Estimation of Linear Regression Model with Collinear RegressorsMuhammad Imdadullah, Muhammad Aslam and Saima Altaf 232\nA Tidy Data Model for Natural Language Processing using cleanNLPTaylor Arnold 248\nmle.tools: An R Package for Maximum Likelihood Bias CorrectionJosmar Mazucheli, André Felipe B. Menezes and Saralees Nadarajah 268\nafmToolkit: an R Package for Automated AFM Force-Distance Curves AnalysisRafael Benítez, Vicente J. Bolós and José-Luis Toca-Herrera 291\nThe welchADF Package for Robust Hypothesis Testing in Unbalanced Multivariate Mixed Models with Heteroscedastic and Non-normal DataPablo J. Villacorta 309\nider: Intrinsic Dimension Estimation with RHideitsu Hino 329\nrpsftm: An R Package for Rank Preserving Structural Failure Time ModelsAnnabel Allison, Ian R White and Simon Bond 342\nanomalyDetection: Implementation of Augmented Network Log Anomaly Detection ProceduresRobert J. Gutierrez, Bradley C. Boehmke, Kenneth W. Bauer, Cade M. Saie and Trevor J. Bihl 354\nSimulating Noisy, Nonparametric, and Multivariate Discrete PatternsRuby Sharma, Sajal Kumar, Hua Zhong and Mingzhou Song 366\nglmmTMB Balances Speed and Flexibility Among Packages for Zero-inflated Generalized Linear Mixed ModelingMollie E. Brooks, Kasper Kristensen, Koen J. van Benthem, Arni Magnusson, Casper W. Berg, Anders Nielsen, Hans J. Skaug, Martin Mächler and Benjamin M. Bolker 378\nSimulating Probabilistic Long-Term Effects in Models with Temporal DependenceChristopher Gandrud and Laron K. Williams 401\nRQGIS: Integrating R with QGIS for Statistical GeocomputingJannes Muenchow, Patrick Schratz and Alexander Brenning 409\nPartial Rank Data with the hyper2 Package: Likelihood Functions for Generalized Bradley-Terry ModelsRobin K. S. Hankin 429\nriskRegression: Predicting the Risk of an Event using Cox Regression ModelsBrice Ozenne, Anne Lyngholm Sørensen, Thomas Scheike, Christian Torp-Pedersen and Thomas Alexander Gerds 440\nLeArEst: Length and Area Estimation from Data Measured with Additive ErrorMirta Benšić, Petar Taler, Safet Hamedović, Emmanuel Karlo Nyarko and Kristian Sabo 461\nSplitting It Up: The spduration Split-Population Duration Regression Package for Time-Varying CovariatesAndreas Beger, Daniel W. Hill, Jr., Nils. W. Metternich, Shahryar Minhas and Michael D. Ward 474\nBayesian Regression Models for Interval-censored Data in RClifford Anderson-Bergman 487\nopenEBGM: An R Implementation of the Gamma-Poisson Shrinker Data Mining ModelTravis Canida and John Ihrie 499\nrentrez: An R package for the NCBI eUtils APIDavid J. Winter 520\nAn Introduction to Rocker: Docker Containers for RCarl Boettiger and Dirk Eddelbuettel 527\nNews and Notes\nConference Report: useR!2017Tobias Verbeke 537\nConference Report: R in Insurance 2017Nicolas Baradel, Christophe Dutang and Caroline Hillairet 539\nForwards ColumnStella Bollmann, Dianne Cook, Jasmine Dumas, John Fox, Julie Josse, Oliver Keyes, Carolin Strobl, Heather Turner and Rudolf Debelak 541\nR Teaching ColumnMatthias Gehrke, Reed Davis, Norman Matloff, Paul Thompson, Tiffany Chen, Emily Watkins and Laurel Beckett 553\nR Foundation NewsTorsten Hothorn 563\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 564\nNews from the Bioconductor ProjectBioconductor Core Team 567\nChanges in RR Core Team 568\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:01+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2017-1/",
    "title": "Volume 9/1",
    "description": "Articles published in the June 2017 issue",
    "author": [],
    "date": "2017-06-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nEditorialRoger Bivand 4\nContributed Research Articles\niotools: High-Performance I/O Tools for RTaylor Arnold, Michael J. Kane and Simon Urbanek 6\nIsoGeneGUI: Multiple Approaches for Dose-Response Analysis of Microarray Data Using RMartin Otava, Rudradev Sengupta, Ziv Shkedy, Dan Lin, Setia Pramana, Tobias Verbeke, Philippe Haldermans, Ludwig A. Hothorn, Daniel Gerhard, Rebecca M. Kuiper, Florian Klinglmueller and Adetayo Kasim 14\nNetwork Visualization with ggplot2Sam Tyner, François Briatte and Heike Hofmann 27\nOrthoPanels: An R Package for Estimating a Dynamic Panel Model with Fixed Effects Using the Orthogonal Reparameterization ApproachMark Pickup, Paul Gustafson, Davor Cubranic and Geoffrey Evans 60\nThe mosaic Package: Helping Students to Think with Data Using RRandall Pruim, Daniel T Kaplan and Nicholas J Horton 77\nsmoof: Single- and Multi-Objective Optimization Test FunctionsJakob Bossek 103\nminval: An R package for MINimal VALidation of Stoichiometric ReactionsDaniel Osorio, Janneth González and Andrés Pinzón 114\nWorking with Daily Climate Model Output Data in R and the futureheatwaves PackageG. Brooke Anderson, Colin Eason and Elizabeth A. Barnes 124\nalineR: an R Package for Optimizing Feature-Weighted Alignments and Linguistic DistancesSean S. Downey, Guowei Sun and Peter Norquest 138\nImplementing a Metapopulation Bass Diffusion Model using the R Package deSolveJim Duggan 153\nMDplot: Visualise Molecular DynamicsChristian Margreitter and Chris Oostenbrink 164\nOn Some Extensions to GA Package: Hybrid Optimisation, Parallelisation and Islands EvolutionOn some extensions to GA package: hybrid optimisation, parallelisation and islands evolutionLuca Scrucca 187\nimputeTS: Time Series Missing Value Imputation in RSteffen Moritz and Thomas Bartz-Beielstein 207\nThe NoiseFiltersR Package: Label Noise Preprocessing in RPablo Morales, Julián Luengo, Luís P.F. Garcia, Ana C. Lorena, André C.P.L.F. de Carvalho and Francisco Herrera 219\ncoxphMIC: An R Package for Sparse Estimation of Cox Proportional Hazards Models via Approximated Information CriteriaRazieh Nabi and Xiaogang Su 229\nUpdate of the nlme Package to Allow a Fixed Standard Deviation of the Residual ErrorSimon H. Heisterkamp, Engelbertus van Willigen, Paul-Matthias Diderichsen and John Maringwa 239\nEMSaov: An R Package for the Analysis of Variance with the Expected Mean Squares and its Shiny ApplicationHye-Min Choe, Mijeong Kim and Eun-Kyung Lee 252\nGsymPoint: An R Package to Estimate the Generalized Symmetry Point, an Optimal Cut-off Point for Binary Classification in Continuous Diagnostic TestsMónica López-Ratón, Elisa M. Molanes-López, Emilio Letón and Carmen Cadarso-Suárez 262\nautoimage: Multiple Heat Maps for Projected CoordinatesJoshua P. French 284\nMarket Area Analysis for Retail and Service Locations with MCIThomas Wieland 298\nPSF: Introduction to R Package for Pattern Sequence Based Forecasting AlgorithmNeeraj Bokde, Gualberto Asencio-Cortés, Francisco Martínez-Álvarez and Kishore Kulat 324\nflan: An R Package for Inference on Mutation Models.Adrien Mazoyer, Rémy Drouilhet, Stéphane Despréaux and Bernard Ycart 334\nMultilabel Classification with R Package mlrPhilipp Probst, Quay Au, Giuseppe Casalicchio, Clemens Stachl and Bernd Bischl 352\nCounterfactual: An R Package for Counterfactual AnalysisMingli Chen, Victor Chernozhukov, Iván Fernández-Val and Blaise Melly 370\nRetrieval and Analysis of Eurostat Open Data with the eurostat PackageLeo Lahti, Janne Huovari, Markus Kainu and Przemysław Biecek 385\nPGEE: An R Package for Analysis of Longitudinal Data with High-Dimensional CovariatesGul Inan and Lan Wang 393\nBayesBinMix: an R Package for Model Based Clustering of Multivariate Binary DataPanagiotis Papastamoulis and Magnus Rattray 403\npdp: An R Package for Constructing Partial Dependence PlotsBrandon M. Greenwell 421\ncheckmate: Fast Argument Checks for Defensive R ProgrammingMichel Lang 437\nmilr: Multiple-Instance Logistic Regression with Lasso PenaltyPing-Yang Chen, Ching-Chuan Chen, Chun-Hao Yang, Sheng-Mao Chang and Kuo-Jung Lee 446\nspcadjust: An R Package for Adjusting for Estimation Error in Control ChartsAxel Gandy and Jan Terje Kvaløy 458\nWeighted Effect Coding for Observational Data with wecRense Nieuwenhuis, Manfred te Grotenhuis and Ben Pelzer 477\nHosting Data Packages via drat: A Case Study with Hurricane Exposure DataG. Brooke Anderson and Dirk Eddelbuettel 486\nNews and Notes\nR Foundation NewsTorsten Hothorn 498\nConference Report: European R Users Meeting 2016Maciej Beręsewicz, Adolfo Alvarez, Przemysław Biecek, Marcin K. Dyderski, Marcin Kosinski, Jakub Nowosad, Kamil Rotter, Alicja Szabelska-Beręsewicz, Marcin Szymkowiak, Łukasz Wawrowski and Joanna Zyprych-Walczak 501\nChanges on CRANKurt Hornik, Uwe Ligges and Achim Zeileis 505\nNews from the Bioconductor ProjectBioconductor Core Team 508\nChanges in RR Core Team 509\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2016-2/",
    "title": "Volume 8/2",
    "description": "Articles published in the Dec. 2016 issue",
    "author": [],
    "date": "2016-12-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nEditorialMichael Lawrence 4\nContributed Research Articles\nmultipleNCC: Inverse Probability Weighting of Nested Case-Control DataNathalie C. Støer and Sven Ove Samuelsen 5\nQPot: An R Package for Stochastic Differential Equation Quasi-Potential AnalysisChristopher M. Moore, Christopher R. Stieha, Ben C. Nolting, Maria K. Cameron and Karen C. Abbott 19\nDesign of the TRONCO BioConductor Package for TRanslational ONCOlogyMarco Antoniotti, Giulio Caravagna, Luca De Sano, Alex Graudenzi, Giancarlo Mauri, Bud Mishra and Daniele Ramazzotti 39\ndiverse: an R Package to Analyze Diversity in Complex SystemsMiguel R. Guevara, Dominik Hartmann and Marcelo Mendoza 60\nSimulating Correlated Binary and Multinomial Responses under Marginal Model Specification: The SimCorMultRes PackageAnestis Touloumis 79\neiCompare: Comparing Ecological Inference Estimates across EI and EI:RCLoren Collingwood, Kassra Oskooii, Sergio Garcia-Rios and Matt Barreto 92\nrnrfa: An R package to Retrieve, Filter and Visualize Data from the UK National River Flow ArchiveClaudia Vitolo, Matthew Fry and Wouter Buytaert 102\nQtools: A Collection of Models and Tools for Quantile InferenceMarco Geraci 117\nTwo-Tier Latent Class IRT Models in RSilvia Bacci and Francesco Bartolucci 139\nVariants of Simple Correspondence AnalysisRosaria Lombardo and Eric J. Beh 167\nhdm: High-Dimensional MetricsVictor Chernozhukov, Chris Hansen and Martin Spindler 185\nNormal Tolerance Interval Procedures in the tolerance PackageDerek S. Young 200\neasyROC: An Interactive Web-tool for ROC Curve Analysis Using R Language EnvironmentDincer Goksuluk, Selcuk Korkmaz, Gokmen Zararsiz and A. Ergun Karaagaoglu 213\ntigris: An R Package to Access and Work with Geographic Data from the US Census BureauKyle Walker 231\nEscape from BoxlandBarret Schloerke, Hadley Wickham, Dianne Cook and Heike Hofmann 243\nAke: An R Package for Discrete and Continuous Associated Kernel EstimationsWanbitching E. Wansouwé, Sobom M. Somé and Célestin C. Kokonendji 258\nAn Introduction to Principal Surrogate Evaluation with the pseval PackageMichael C. Sachs and Erin E. Gabriel 277\nCalculating Biological Module Enrichment or Depletion and Visualizing Data on Large-scale Molecular Maps with ACSNMineR and RNaviCell PackagesPaul Deveau, Emmanuel Barillot, Valentina Boeva, Andrei Zinovyev and Eric Bonnet 293\nSubgroup Discovery with Evolutionary Fuzzy Systems in R: The SDEFSR PackageÁngel M. García, Francisco Charte, Pedro González, Cristóbal J. Carmona and María J. del Jesus 307\ndCovTS: Distance Covariance/Correlation for Time SeriesMaria Pitsillou and Konstantinos Fokianos 324\ncomf: An R Package for Thermal Comfort StudiesMarcel Schweiker 341\nwater: Tools and Functions to Estimate Actual Evapotranspiration Using Land Surface Energy Balance Models in RGuillermo Federico Olmedo, Samuel Ortega-Farías, Daniel de la Fuente-Sáiz, David Fonseca- Luego and Fernando Fuentes-Peñailillo 352\nquantreg.nonpar: An R Package for Performing Nonparametric Series Quantile RegressionMichael Lipsitz, Alexandre Belloni, Victor Chernozhukov and Iván Fernández-Val 370\nnmfgpu4R: GPU-Accelerated Computation of the Non-Negative Matrix Factorization (NMF) Using CUDA Capable HardwareSven Koitka and Christoph M. Friedrich 382\nComputing Pareto Frontiers and Database Preferences with the rPref PackagePatrick Roocks 393\nmicompr: An R Package for Multivariate Independent Comparison of ObservationsNuno Fachada, João Rodrigues, Vitor V. Lopes, Rui C. Martins and Agostinho C. Rosa 405\nmixtox: An R Package for Mixture Toxicity AssessmentXiang-Wei Zhu and Jian-Yi Chen 421\nWeighted Distance Based Discriminant Analysis: The R Package WeDiBaDisItziar Irigoien, Francesc Mestres and Concepcion Arenas 434\nDistance Measures for Time Series in R: The TSdist PackageUsue Mori, Alexander Mendiburu and Jose A. Lozano 451\ncondSURV: An R Package for the Estimation of the Conditional Survival Function for Ordered Multivariate Failure Time DataLuis Meira-Machado and Marta Sestelo 460\nggfortify: Unified Interface to Visualize Statistical Results of Popular R PackagesYuan Tang, Masaaki Horikoshi and Wenxuan Li 474\nMeasurement Units in REdzer Pebesma, Thomas Mailund and James Hiebert 486\nmctest: An R Package for Detection of Collinearity among RegressorsMuhammad Imdadullah, Muhammad Aslam and Saima Altaf 495\nNews and Notes\nR Foundation Newsby Torsten Hothorn 506\nChanges on CRANby Kurt Hornik and Achim Zeileis 507\nNews from the Bioconductor Projectby Bioconductor Core Team 510\nChanges in Rby the R Core Team 511\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2016-1/",
    "title": "Volume 8/1",
    "description": "Articles published in the Aug. 2016 issue",
    "author": [],
    "date": "2016-06-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nEditorialMichael Lawrence 4\nContributed Research Articles\nmetaplus: An R Package for the Analysis of Robust Meta-Analysis and Meta-RegressionKen J. Beath 5\nGender Prediction Methods Based on First Names with genderizeRKamil Wais 17\nConditional Fractional Gaussian Fields with the Package FieldSimAlexandre Brouste, Jacques Istas and Sophie Lambert-Lacroix 38\nrTableICC: An R Package for Random Generation of 22K and RC Contingency TablesHaydar Demirhan 48\nMaps, Coordinate Reference Systems and Visualising Geographic Data with mapmiscPatrick E. Brown 64\nVariable Clustering in High-Dimensional Linear Regression: The R Package clereLoïc Yengo, Julien Jacques, Christophe Biernacki and Mickael Canouil 92\nStylometry with R: A Package for Computational Text AnalysisMaciej Eder, Jan Rybicki and Mike Kestemont 107\nquickpsy: An R Package to Fit Psychometric Functions for Multiple GroupsDaniel Linares and Joan López-Moliner 122\nFWDselect: An R Package for Variable Selection in Regression ModelsMarta Sestelo, Nora M. Villanueva, Luis Meira-Machado and Javier Roca-Pardiñas 132\nAn Interactive Survey Application for Validating Social Network Analysis TechniquesMitchell Joblin and Wolfgang Mauerer 149\nExploring Interaction Effects in Two-Factor Studies using the hiddenf Package in R.Christopher T. Franck and Jason A. Osborne 159\nHeteroscedastic Censored and Truncated Regression with crchJakob W. Messner, Georg J. Mayr and Achim Zeileis 173\nModel Builder for Item Factor Analysis with OpenMxJoshua N. Pritikin and Karen M. Schmidt 182\nSpatio-Temporal Interpolation using gstatBenedikt Gräler, Edzer Pebesma and Gerard Heuvelink 204\nSWMPr: An R Package for Retrieving, Organizing, and Analyzing Environmental Data for EstuariesMarcus W Beck 219\nCryptRndTest: An R Package for Testing the Cryptographic RandomnessHaydar Demirhan and Nihan Bitirim 233\nscmamp: Statistical Comparison of Multiple Algorithms in Multiple ProblemsBorja Calvo and Guzmán Santafé 248\nkeyplayer: An R Package for Locating Key Players in Social NetworksWeihua An and Yu-Hsin Liu 257\nSchemaOnRead: A Package for Schema-on-Read in RMichael J. North 269\nCrowdsourced Data Preprocessing with R and Amazon Mechanical TurkThomas J. Leeper 276\nmclust 5: Clustering, Classification and Density Estimation Using Gaussian Finite Mixture ModelsLuca Scrucca, Michael Fop, T. Brendan Murphy and Adrian E. Raftery 289\nclustering.sc.dp: Optimal Clustering with Sequential Constraint by Using Dynamic ProgrammingTibor Szkaliczki 318\nprogenyClust: an R package for Progeny ClusteringChenyue W. Hu and Amina A. Qutub 328\nstatmod: Probability Calculations for the Inverse Gaussian DistributionGöknur Giner and Gordon K. Smyth 339\nUsing DECIPHER v2.0 to Analyze Big Biological Sequence Data in RErik S. Wright 352\nR Packages to Aid in Handling Web Access LogsOliver Keyes, Bob Rudis and Jay Jacobs 360\nNonparametric Tests for the Interaction in Two-way Factorial Designs Using RJos Feys 367\nGMDH: An R Package for Short Term Forecasting via GMDH-Type Neural Network AlgorithmsOsman Dag and Ceylan Yozgatligil 379\nsbtools: A Package Connecting R to Cloud-based Data for Collaborative Online ResearchLuke A Winslow, Scott Chamberlain, Alison P Appling and Jordan S Read 387\nNews and Notes\nConference Report: useR! 2016Joe Rickert 399\nChanges on CRANKurt Hornik and Achim Zeileis 402\nNews from the Bioconductor ProjectThe Bioconductor Team 404\nChanges in RThe R Core Team 406\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2015-2/",
    "title": "Volume 7/2",
    "description": "Articles published in the Dec. 2015 issue",
    "author": [],
    "date": "2015-12-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nEditorialBettina Grün 4\nContributed Research Articles\nFitting Conditional and Simultaneous Autoregressive Spatial Models in hglmMoudud Alam, Lars Rönnegård and Xia Shen 5\nVSURF: An R Package for Variable Selection Using Random ForestsRobin Genuer, Jean-Michel Poggi and Christine Tuleau-Malot 19\nzoib: An R Package for Bayesian Inference for Beta Regression and Zero/One Inflated Beta RegressionFang Liu and Yunchuan Kong 34\napc: An R Package for Age-Period-Cohort AnalysisBent Nielsen 52\nQuantifQuantile: An R Package for Performing Quantile Regression Through Optimal QuantizationIsabelle Charlier, Davy Paindaveine and Jérôme Saracco 65\nNumerical Evaluation of the Gauss Hypergeometric Function with the hypergeo PackageRobin K. S. Hankin 81\nSRCS: Statistical Ranking Color Scheme for Visualizing Parameterized Multiple Pairwise Comparisons with RPablo J. Villacorta and José A. Sáez 89\nAn R Package for the Panel Approach Method for Program Evaluation: pampeAinhoa Vega-Bayo 105\nBSGS: Bayesian Sparse Group SelectionKuo-Jung Lee and Ray-Bing Chen 122\nClustVarLV: An R Package for the Clustering of Variables Around Latent VariablesEvelyne Vigneau, Mingkun Chen and El Mostafa Qannari 134\nWorking with Multilabel Datasets in R: The mldr PackageFrancisco Charte and David Charte 149\nPracTools: Computations for Design of Finite Population SamplesRichard Valliant, Jill A. Dever and Frauke Kreuter 163\nALTopt: An R Package for Optimal Experimental Design of Accelerated Life TestingKangwon Seo and Rong Pan 177\nabctools: An R Package for Tuning Approximate Bayesian Computation AnalysesMatthew A. Nunes and Dennis Prangle 189\nmtk: A General-Purpose and Extensible R Environment for Uncertainty and Sensitivity Analyses of Numerical ExperimentsJuhui Wang, Robert Faivre, Hervé Richard and Hervé Monod 206\ntreeClust: An R Package for Tree-Based Clustering DissimilaritiesSamuel E. Buttrey and Lyn R. Whitaker 227\nmmpp: A Package for Calculating Similarity and Distance Metrics for Simple and Marked Temporal Point ProcessesHideitsu Hino, Ken Takano and Noboru Murata 237\nOpen-Channel Computation with RMichael C. Koohafkan and Bassam A. Younis 249\nGeneralized Hermite Distribution Modelling with the R Package hermiteDavid Moriña, Manuel Higueras, Pedro Puig and María Oliveira 263\nCode Profiling in R: A Review of Existing Methods and an Introduction to Package GUIProfilerAngel Rubio and Fernando de Villar 275\nNews and Notes\nThe R Consortium and the R FoundationMartyn Plummer 288\nConference Report: useR! 2015Torben Tvedebrink 289\nNews from the Bioconductor ProjectThe Bioconductor Team 291\nChanges in RThe R Core Team 293\nChanges on CRANKurt Hornik and Achim Zeileis 298\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2015-1/",
    "title": "Volume 7/1",
    "description": "Articles published in the June 2015 issue",
    "author": [],
    "date": "2015-06-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nEditorialBettina Grün 3\nContributed Research Articles\nPeptides: A Package for Data Mining of Antimicrobial PeptidesDaniel Osorio, Paola Rondón-Villarreal and Rodrigo Torres 4\nfanplot: An R Package for Visualising Sequential DistributionsGuy J. Abel 15\nsparkTable: Generating Graphical Tables for Websites and Documents with RAlexander Kowarik, Bernhard Meindl and Matthias Templ 24\nrdrobust: An R Package for Robust Nonparametric Inference in Regression-Discontinuity DesignsSebastian Calonico, Matias D. Cattaneo and Rocío Titiunik 38\nFrames2: A Package for Estimation in Dual Frame SurveysAntonio Arcos, David Molina, Maria Giovanna Ranalli and María del Mar Rueda 52\nThe Complex Multivariate Gaussian DistributionRobin K. S. Hankin 73\nsae: An R Package for Small Area EstimationIsabel Molina and Yolanda Marhuenda 81\nshowtext: Using System Fonts in R GraphicsYixuan Qiu 99\nCorrespondence Analysis on Generalised Aggregated Lexical Tables (CA-GALT) in the FactoMineR PackageBelchin Kostov, Mónica Bécue-Bertaut and François Husson 109\nImplementing Persistent O(1) Stacks and Queues in RShawn T. O’Neil 118\nR as an Environment for Reproducible Analysis of DNA Amplification ExperimentsStefan Rödiger, Michał Burdukiewicz, Konstantin Blagodatskikh, Michael Jahn and Peter Schierack 127\nThe gridGraphics PackagePaul Murrell 151\nfslr: Connecting the FSL Software with RJohn Muschelli, Elizabeth Sweeney, Martin Lindquist and Ciprian Crainiceanu 163\nIdentifying Complex Causal Dependencies in Configurational Data with Coincidence AnalysisMichael Baumgartner and Alrik Thiem 176\nManipulation of Discrete Random Variables with discreteRVEric Hare, Andreas Buja and Heike Hofmann 185\nEstimability Tools for Package DevelopersRussell V. Lenth 195\nNews and Notes\nR Foundation NewsKurt Hornik 200\nChanges on CRANKurt Hornik and Achim Zeileis 201\nChanges in RThe R Core Team 227\nNews from the Bioconductor ProjectThe Bioconductor Team 239\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2014-2/",
    "title": "Volume 6/2",
    "description": "Articles published in the Dec. 2014 issue",
    "author": [],
    "date": "2014-12-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nEditorialDeepayan Sarkar 3\nContributed Research Articles\nCoordinate-Based Meta-Analysis of fMRI Studies with RAndrea Stocco 5\nAutomatic Conversion of Tables to LongForm DataframesJimmy Oh 16\nPrinsimpJonathan Zhang, Nancy Heckman, Davor Cubranic, Joel G. Kingsolver, Travis Gaydos and J.S. Marron 27\nphaseR: An R Package for Phase Plane Analysis of Autonomous ODE SystemsMichael J. Grayling 43\nFlexible R Functions for Processing Accelerometer Data, with Emphasis on NHANES 2003-2006Dane R. Van Domelen and W. Stephen Pittard 52\nApplying spartan to Understand Parameter Uncertainty in SimulationsKieran Alden, Mark Read, Paul S Andrews, Jon Timmis and Mark Coles 63\nngspatial: A Package for Fitting the Centered Autologistic and Sparse Spatial Generalized Linear Mixed Models for Areal DataJohn Hughes 81\nsgof: An R Package for Multiple Testing ProblemsIrene Castro-Conde and Jacobo de Uña-Álvarez 96\nbshazard: A Flexible Tool for Nonparametric Smoothing of the Hazard FunctionPaola Rebora, Agus Salim and Marie Reilly 114\nSMR: An R package for computing the externally studentized normal midrange distributionBen Dêivide Oliveira Batista and Daniel Furtado Ferreira 123\nFarewell’s Linear Increments Model for Missing Data: The FLIM packageRune Hoff, Jon Michael Gran and Daniel Farewell 137\nMVN: An R Package for Assessing Multivariate NormalitySelcuk Korkmaz, Dincer Goksuluk and Gokmen Zararsiz 151\nqmethod: A Package to Explore Human Perspectives Using Q MethodologyAiora Zabala 163\ngset: An R Package for Exact Sequential Test of Equivalence Hypothesis Based on Bivariate Non-Central t-StatisticsFang Liu 174\nNews and Notes\nConference Report: R in Insurance 2014Markus Gesmann and Andreas Tsanakas 185\nConference Report Polish Academic R User MeetingMaciej Beręsewicz, Alicja Szabelska, Joanna Zyprych-Walczak and Łukasz Wawrowski 187\nR Foundation NewsMartin Mächler and Kurt Hornik 190\nChanges on CRANKurt Hornik and Achim Zeileis 192\nChanges in RThe R Core Team 224\nNews from the Bioconductor ProjectThe Bioconductor Team 227\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2014-1/",
    "title": "Volume 6/1",
    "description": "Articles published in the June 2014 issue",
    "author": [],
    "date": "2014-06-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nEditorialDeepayan Sarkar 3\nContributed Research Articles\nTaming PITCHf/x Data with XML2R and pitchRxCarson Sievert 5\nA Multiscale Test of Spatial Stationarity for Textured Images in RMatthew A. Nunes, Sarah L. Taylor and Idris A. Eckley 20\nStratified Weibull Regression Model for Interval-Censored DataXiangdong Gu, David Shapiro, Michael D. Hughes and Raji Balasubramanian 31\nbrainR: Interactive 3 and 4D Images of High Resolution Neuroimage DataJohn Muschelli, Elizabeth Sweeney and Ciprian Crainiceanu 41\nThe RWiener Package: an R Package Providing Distribution Functions for the Wiener Diffusion ModelDominik Wabersich and Joachim Vandekerckhove 49\nPivotalR: A Package for Machine Learning on Big DataHai Qian 57\nrotations: An R Package for SO(3) DataBryan Stanfill, Heike Hofmann and Ulrike Genschel 68\nROSE: a Package for Binary Imbalanced LearningNicola Lunardon, Giovanna Menardi and Nicola Torelli 79\ninvestr: An R Package for Inverse EstimationBrandon M. Greenwell and Christine M. Schubert Kabban 90\nRankcluster: An R Package for Clustering Multivariate Partial RankingsJulien Jacques, Quentin Grimonprez and Christophe Biernacki 101\nThe stringdist Package for Approximate String MatchingMark P.J. van der Loo 111\nRStorm: Developing and Testing Streaming Algorithms in RMaurits Kaptein 123\nThe gridSVG PackagePaul Murrell and Simon Potter 133\nMRCV: A Package for Analyzing Categorical Variables with Multiple Response OptionsNatalie A. Koziol and Christopher R. Bilder 144\nArchiving Reproducible Research with R and DataverseThomas J. Leeper 151\noligoMask: A Framework for Assessing and Removing the Effect of Genetic Variants on Microarray ProbesDaniel Bottomly, Beth Wilmot and Shannon K. McWeeney 159\nsgr: A Package for Simulating Conditional Fake Ordinal DataLuigi Lombardi and Massimiliano Pastore 164\nNews and Notes\nWeb Technologies Task ViewPatrick Mair and Scott Chamberlain 178\nAddendum to ``Statistical Software from a Blind Person’s Perspective’’A. Jonathan R. Godfrey and Robert Erhardt 182\nR Foundation NewsKurt Hornik 183\nNews from the Bioconductor ProjectBioconductor Team 184\nChanges on CRANKurt Hornik and Achim Zeileis 186\nChanges in RThe R Core Team 221\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2013-2/",
    "title": "Volume 5/2",
    "description": "Articles published in the Dec. 2013 issue",
    "author": [],
    "date": "2013-12-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nEditorialHadley Wickham 3\nContributed Research Articles\nfactorplot: Improving Presentation of Simple Contrasts in Generalized Linear ModelsDavid A. Armstrong II 4\nspMC: Modelling Spatial Random Fields with Continuous Lag Markov ChainsLuca Sartore 16\nRNetCDF - A Package for Reading and Writing NetCDF DatasetsPavel Michna and Milton Woods 29\nSurface Melting Curve Analysis with RStefan Rödiger, Alexander Böhm and Ingolf Schimke 37\nPerformance Attribution for Equity PortfoliosYang Lu and David Kane 53\nExactCIdiff: An R Package for Computing Exact Confidence Intervals for the Difference of Two ProportionsGuogen Shan and Weizhen Wang 62\nrlme: An R Package for Rank-Based Estimation and Prediction in Random Effects Nested ModelsYusuf K. Bilgic and Herbert Susmann 71\nTemporal Disaggregation of Time SeriesChristoph Sax and Peter Steiner 80\nDynamic Parallelization of R FunctionsStefan Böhringer 88\nCompLognormal: An R Package for Composite Lognormal DistributionsS. Nadarajah and S. A. A. Bakar 97\nlfe: Linear Group Fixed EffectsSimen Gaure 104\nThe R in RoboticsAndré Dietrich, Sebastian Zug and Jörg Kaiser 117\nOn Sampling from the Multivariate t DistributionMarius Hofert 129\nbetategarch: Simulation, Estimation and Forecasting of Beta-Skew-t-EGARCH ModelsGenaro Sucarrat 137\nChanges to grid for R 3.0.0Paul Murrell 148\nNews and Notes\nR Foundation NewsKurt Hornik 161\nNews from the Bioconductor ProjectBioconductor Team 162\nConference Report: Deuxièmes Rencontres RAurelie Siberchicot and Stephane Dray 164\nChanges on CRANKurt Hornik and Achim Zeileis 166\nChanges in RThe R Core Team 192\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2013-1/",
    "title": "Volume 5/1",
    "description": "Articles published in the June 2013 issue",
    "author": [],
    "date": "2013-06-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nEditorialHadley Wickham 4\nContributed Research Articles\nRTextTools: A Supervised Learning Package for Text ClassificationTimothy P. Jurka, Loren Collingwood, Amber E. Boydstun, Emiliano Grossman and Wouter van Atteveldt 6\nGeneralized Simulated Annealing for Global Optimization: The GenSA PackageYang Xiang, Sylvain Gubian, Brian Suomela and Julia Hoeng 13\nMultiple Factor Analysis for Contingency Tables in the FactoMineR PackageBelchin Kostov, Mónica Bécue-Bertaut and François Husson 29\nHypothesis Tests for Multivariate Linear Models Using the car PackageJohn Fox, Michael Friendly and Sanford Weisberg 39\nosmar: OpenStreetMap and RManuel J. A. Eugster and Thomas Schlesinger 53\nftsa: An R Package for Analyzing Functional Time SeriesHan Lin Shang 64\nStatistical Software from a Blind Person’s PerspectiveA. Jonathan R. Godfrey 73\nPIN: Measuring Asymmetric Information in Financial Markets with RPaolo Zagaglia 80\nQCA: A Package for Qualitative Comparative AnalysisAlrik Thiem and Adrian Duşa 87\nAn Introduction to the EcoTroph R Package: Analyzing Aquatic Ecosystem Trophic NetworksMathieu Colléter, Jérôme Guitton and Didier Gascuel 98\nstellaR: A Package to Manage Stellar Evolution Tracks and IsochronesMatteo Dell’Omodarme and Giada Valle 108\nLet Graphics Tell the Story - Datasets in RAntony Unwin, Heike Hofmann and Dianne Cook 117\nEstimating Spatial Probit Models in RStefan Wilhelm and Miguel Godinho de Matos 130\nggmap: Spatial Visualization with ggplot2David Kahle and Hadley Wickham 144\nmpoly: Multivariate Polynomials in RDavid Kahle 162\nbeadarrayFilter: An R Package to Filter BeadsAnyiawung Chiara Forcheh, Geert Verbeke, Adetayo Kasim, Dan Lin, Ziv Shkedy, Willem Talloen, Hinrich W.H. Göhlmann and Lieven Clement 171\nFast Pure R Implementation of GEE: Application of the Matrix PackageLee S. McDaniel, Nicholas C. Henderson and Paul J. Rathouz 181\nRcmdrPlugin.temis, a Graphical Integrated Text Mining Solution in RMilan Bouchet-Valat and Gilles Bastin 188\nPossible Directions for Improving Dependency Versioning in RJeroen Ooms 197\nTranslating Probability Density Functions: From R to BUGS and Back AgainDavid S. LeBauer, Michael C. Dietze and Benjamin M. Bolker 207\nNews and Notes\nConference Review: The 6th Chinese R ConferenceJing Leng and Jingjing Guan 210\nConference Report: R/Finance 2013Joshua Ulrich 212\nThe R User Conference 2013UseR 2013 Organising Committee 215\nNews from the Bioconductor ProjectBioconductor Team 218\nR Foundation NewsKurt Hornik 220\nChanges in RThe R Core Team 221\nChanges on CRANKurt Hornik and Achim Zeileis 239\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2012-2/",
    "title": "Volume 4/2",
    "description": "Articles published in the Dec. 2012 issue",
    "author": [],
    "date": "2012-12-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nWhat’s in a Name?Paul Murrell 5\nIt’s Not What You Draw,It’s What You Don’t DrawPaul Murrell 13\nDebugging grid GraphicsPaul Murrell and Velvet Ly 19\nfrailtyHL: A Package for Fitting Frailty Models with H-likelihoodIl Do Ha, Maengseok Noh and Youngjo Lee 28\ninfluence.ME: Tools for Detecting Influential Data in Mixed Effects ModelsRense Nieuwenhuis, Manfred te Grotenhuis and Ben Pelzer 38\nThe crs Package: Nonparametric Regression Splines for Continuous and Categorical PredictorsZhenghua Nie and Jeffrey S. Racine 48\nRfit: Rank-based Estimation for Linear ModelsJohn D. Kloke and Joseph W. McKean 57\nGraphical Markov Models with Mixed Graphs in RKayvan Sadeghi and Giovanni M. Marchetti 65\nThe State of Naming Conventions in RRasmus Bååth 74\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2012-1/",
    "title": "Volume 4/1",
    "description": "Articles published in the June 2012 issue",
    "author": [],
    "date": "2012-06-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nAnalysing Seasonal DataAdrian G Barnett, Peter Baker and Annette J Dobson 5\nMARSS: Multivariate Autoregressive State-space Models for Analyzing Time-series DataElizabeth E. Holmes, Eric J. Ward and Kellie Wills 11\nopenair - Data Analysis Tools for the Air Quality CommunityKarl Ropkins and David C. Carslaw 20\nForeign Library InterfaceDaniel Adler 30\nVdgraph: A Package for Creating Variance Dispersion GraphsJohn Lawson 41\nxgrid and R: Parallel Distributed Processing Using Heterogeneous Groups of Apple ComputersSarah C. Anoke, Yuting Zhao, Rafael Jaeger and Nicholas J. Horton 45\nmaxent: An R Package for Low-memory Multinomial Logistic Regression with Support for Semi-automated Text ClassificationTimothy P. Jurka 56\nSumo: An Authenticating Web Application with an Embedded R SessionTimothy T. Bergsma and Michael S. Smith 60\nWho Did What? The Roles of R Package Authors and How to Refer to ThemKurt Hornik, Duncan Murdoch and Achim Zeileis 64\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2011-2/",
    "title": "Volume 3/2",
    "description": "Articles published in the Dec. 2011 issue",
    "author": [],
    "date": "2011-12-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nCreating and Deploying an Application with (R)Excel and RThomas Baier, Erich Neuwirth and Michele De Meo 5\nglm2: Fitting Generalized Linear Models with Convergence ProblemsIan C. Marschner 12\nImplementing the Compendium Concept with Sweave and DOCSTRIPMichael Lundholm 16\nWatch Your Spelling!Kurt Hornik and Duncan Murdoch 22\nCkmeans.1d.dp: Optimal k-means Clustering in One Dimension by Dynamic ProgrammingHaizhou Wang and Mingzhou Song 29\nNonparametric Goodness-of-Fit Tests for Discrete Null DistributionsTaylor B. Arnold and John W. Emerson 34\nUsing the Google Visualisation API with RMarkus Gesmann and Diego de Castillo 40\nGrapheR: a Multiplatform GUI for Drawing Customizable Graphs in RMaxime Hervé 45\nrainbow: An R Package for Visualizing Functional Time SeriesHan Lin Shang 54\nPortable C++ for R PackagesMartyn Plummer 60\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2011-1/",
    "title": "Volume 3/1",
    "description": "Articles published in the June 2011 issue",
    "author": [],
    "date": "2011-06-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\ntestthat: Get Started with TestingHadley Wickham 5\nContent-Based Social Network Analysis of Mailing ListsAngela Bohn, Ingo Feinerer, Kurt Hornik and Patrick Mair 11\nRmetrics - timeDate PackageYohan Chalabi, Martin Mächler and Diethelm Würtz 19\nThe digitize Package: Extracting Numerical Data from ScatterplotsTimothée Poisot 25\nDifferential Evolution with DEoptimDavid Ardia, Kris Boudt, Peter Carl, Katharine M. Mullen and Brian G. Peterson 27\nrworldmap : a new R package for mapping global dataAndy South 35\nCryptographic Boolean Functions with RFrédéric Lafitte, Dirk Van Heule and Julien Van hamme 44\nRaster Images in R GraphicsPaul Murrell 48\nProbabilistic Weather Forecasting in RChris Fraley, Adrian Raftery, Tilmann Gneiting, McLean Sloughter and Veronica Berrocal 55\nAnalyzing an Electronic Limit Order BookDavid Kane, Andrew Liu and Khanh Nguyen 64\nGiving a useR! TalkRob J. Hyndman 69\nTips for Presenting Your WorkDianne Cook 72\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2010-2/",
    "title": "Volume 2/2",
    "description": "Articles published in the Dec. 2010 issue",
    "author": [],
    "date": "2010-12-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nSolving Differential Equations in RKarline Soetaert, Thomas Petzoldt and R. Woodrow Setzer 5\nSource ReferencesDuncan Murdoch 16\nhglm: A Package for Fitting Hierarchical Generalized Linear ModelsLars Rönnegård, Xia Shen and Moudud Alam 20\ndclone: Data Cloning in RPéter Sólymos 29\nstringr: modern, consistent string processingHadley Wickham 38\nBayesian Estimation of the GARCH(1,1) Model with Student-t InnovationsDavid Ardia and Lennart F. Hoogerheide 41\ncudaBayesreg: Bayesian Computation in CUDAAdelino Ferreira da Silva 48\nbinGroup: A Package for Group TestingChristopher R. Bilder, Boan Zhang, Frank Schaarschmidt and Joshua M. Tebbs 56\nThe RecordLinkage Package: Detecting Errors in DataMurat Sariyar and Andreas Borg 61\nspikeslab: Prediction and Variable Selection Using Spike and Slab RegressionHemant Ishwaran, Udaya B. Kogalur and J. Sunil Rao 68\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2010-1/",
    "title": "Volume 2/1",
    "description": "Articles published in the June 2010 issue",
    "author": [],
    "date": "2010-06-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nIsoGene: An R Package for Analyzing Dose-response Studies in Microarray ExperimentsSetia Pramana, Dan Lin, Philippe Haldermans, Ziv Shkedy, Tobias Verbeke, Hinrich Göhlmann, An De Bondt, Willem Talloen and Luc Bijnens. 5\nMCMC for Generalized Linear Mixed Models with glmmBUGSPatrick Brown and Lutong Zhou 13\nMapping and Measuring Country ShapesNils B. Weidmann and Kristian Skrede Gleditsch 18\ntmvtnorm: A Package for the Truncated Multivariate Normal DistributionStefan Wilhelm and B. G. Manjunath 25\nneuralnet: Training of Neural NetworksFrauke Günther and Stefan Fritsch 30\nglmperm: A Permutation of Regressor Residuals Test for Inference in Generalized Linear ModelsWiebke Werft and Axel Benner 39\nOnline Reproducible Research: An Application to Multivariate Analysis of Bacterial DNA Fingerprint DataJean Thioulouse, Claire Valiente-Moro and Lionel Zenner 44\nTwo-sided Exact Tests and Matching Confidence Intervals for Discrete DataMichael P. Fay 53\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2009-2/",
    "title": "Volume 1/2",
    "description": "Articles published in the Dec. 2009 issue",
    "author": [],
    "date": "2009-12-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nAspects of the Social Organization and Trajectory of the R ProjectJohn Fox 5\nParty on!Carolin Strobl, Torsten Hothorn and Achim Zeileis 14\nConvergenceConcepts: An R Package to Investigate Various Modes of ConvergencePierre Lafaye de Micheaux and Benoit Liquet 18\nasympTest: A Simple R Package for Classical Parametric Statistical Tests and Confidence Intervals in Large SamplesJ.-F. Coeurjolly, R. Drouilhet, P. Lafaye de Micheaux and J.-F. Robineau 26\ncopas: An R package for Fitting the Copas Selection ModelJ. Carpenter, G. Rücker and G. Schwarzer 31\nTransitioning to R: Replicating SAS, Stata, and SUDAAN Analysis Techniques in Health Policy DataAnthony Damico 37\nRattle: A Data Mining GUI for RGraham J Williams 45\nsos: Searching Help Pages of R PackagesSpencer Graves, Sundar Dorai-Raj and Romain François 56\nThe New R Help SystemDuncan Murdoch and Simon Urbanek 60\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2009-1/",
    "title": "Volume 1/1",
    "description": "Articles published in the June 2009 issue",
    "author": [],
    "date": "2009-06-01",
    "categories": [],
    "contents": "\n\n\nComplete issue \n\n\nTable of contents\n\nFacets of RJohn M. Chambers 5\nCollaborative Software Development Using R-ForgeStefan Theußl and Achim Zeileis 9\nDrawing Diagrams with RPaul Murrell 15\nThe hwriter package: Composing HTML documents with R objectsGregoire Pau and Wolfgang Huber 22\nAdMitDavid Ardia, Lennart F. Hoogerheide and Herman K. van Dijk 25\nexpert: Modeling Without Data Using Expert OpinionVincent Goulet, Michel Jacques and Mathieu Pigeon 31\nNew Numerical Algorithm for Multivariate Normal Probabilities in Package mvtnormXuefei Mi, Tetsuhisa Miwa and Torsten Hothorn 37\nEMD: A Package for Empirical Mode Decomposition and Hilbert SpectrumDonghoh Kim and Hee-Seok Oh 40\nSample Size Estimation while Controlling False Discovery Rate for Microarray Experiments Using the ssize.fdr PackageMegan Orr and Peng Liu 47\nEasier parallel computing in R with snowfall and sfClusterJochen Knaus, Christine Porzelius, Harald Binder and Guido Schwarzer 54\nPMML: An Open Standard for Sharing ModelsAlex Guazzelli, Michael Zeller, Wen-Ching Lin and Graham Williams 60\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2008-2/",
    "title": "R News Volume 8/2",
    "description": "Articles published in the October 2008 issue of R News",
    "author": [],
    "date": "2008-10-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialJohn Fox 1\nContributed Research Articles\nAn introduction to rggobiHadley Wickham, Michael Lawrence, Duncan Temple Lang and Deborah F. Swayne 3\nIntroducing the bipartite package: Analysing ecological networksCarsten F. Dormann, Bernd Gruber and Jochen Fründ 8\nThe profileModel R package: Profiling objectives for models with linear predictorsIoannis Kosmidis 12\nAn introduction to text mining in RIngo Feinerer 19\nAnimation: A package for statistical animationsYihui Xie and Xiaoyue Cheng 23\nThe VGAM packageThomas W. Yee 28\nComparing non-identical objectsPaul Murrell 40\nMvna: An R package for the Nelson-Aalen estimator in multistate modelsA. Allignol, J. Beyersmann and M. Schumacher 48\nProgrammers’ Niche: The Y of RVince Carey 51\nNews and Notes\nChanges in R Version 2.8.0R Core Team 54\nChanges on CRANKurt Hornik 60\nNews from the Bioconductor ProjectBioconductor Team 69\nuseR! 2008Uwe Ligges, Achim Zeileis, Claus Weihs, Gerd Kopp, Friedrich Leisch and Torsten Hothorn 71\nForthcoming Events: useR! 2009David Causeur, Julie Josse, François Husson, Maela Kloareg, Sébastien Lê, Eric Matzner-Løber and Jérôme Pagès 73\nForthcoming Events: DSC 2009 74\nR Foundation NewsKurt Hornik 74\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2008-1/",
    "title": "R News Volume 8/1",
    "description": "Articles published in the May 2008 issue of R News",
    "author": [],
    "date": "2008-05-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialJohn Fox 1\nContributed Research Articles\nUsing Sweave with LyXGregor Gorjanc 2\nTrade costsJeff Enos, David Kane, Arjun Ravi Narayan, Aaron Schwartz, Daniel Suo and Luyi Zhao 10\nSurvival analysis for cohorts with missing covariate informationHormuzd A. Katki and Steven D. Mark 14\nSegmented: An R package to fit regression models with broken-line relationshipsVito M. R. Muggeo 20\nBayesian estimation for parsimonious threshold autoregressive models in RCathy W. S. Chen, Edward M. H. Lin, F. C. Liu and Richard Gerlach 26\nStatistical modeling of loss distributions using actuarVincent Goulet and Mathieu Pigeon 34\nProgrammers’ Niche: Multivariate polynomials in rRobin K. S. Hankin 41\nR Help Desk: How can I avoid this loop or make it faster?Uwe Ligges and John Fox 46\nNews and Notes\nR Help DeskUwe Ligges and John Fox 46\nChanges in R Version 2.7.0R Core Team 51\nChanges on CRANKurt Hornik 59\nNews from the Bioconductor ProjectBioconductor Team 69\nForthcoming Events: useR! 2008Uwe Ligges, Achim Zeileis, Claus Weihs, Gerd Kopp, Friedrich Leisch and Torsten Hothorn 70\nR Foundation NewsKurt Hornik 71\nR News Referees 2007John Fox 72\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2007-3/",
    "title": "R News Volume 7/3",
    "description": "Articles published in the December 2007 issue of R News",
    "author": [],
    "date": "2007-12-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialTorsten Hothorn 1\nContributed Research Articles\nSpherWave: An R package for analyzing scattered spherical data by spherical waveletsHee-Seok Oh and Donghoh Kim 2\nDiving behaviour analysis in RSebastián P. Luque 8\nVery large numbers in R: Introducing package BrobdingnagRobin K. S. Hankin 15\nApplied bayesian non- and semi-parametric inference using DPpackageAlejandro Jara 17\nAn introduction to gWidgetsJohn Verzani 26\nFinancial journalism with RBill Alpert 34\nNeed a hint?Sanford Weisberg and Hadley Wickham 36\nPsychometrics task viewPatrick Mair and Reinhold Hatzinger 38\nMeta: An R package for meta-analysisGuido Schwarzer 40\nExtending the R Commander by “plug-in” packagesJohn Fox 46\nImprovements to the multiple testing package multtestSandra L. Taylor, Duncan Temple Lang and Katherine S. Pollard 52\nNews and Notes\nChanges in R 2.6.1R Core Team 56\nChanges on CRANKurt Hornik 57\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2007-2/",
    "title": "R News Volume 7/2",
    "description": "Articles published in the October 2007 issue of R News",
    "author": [],
    "date": "2007-10-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialTorsten Hothorn 1\nContributed Research Articles\nNew functions for multivariate analysisPeter Dalgaard 2\nGnm: A package for generalized nonlinear modelsHeather Turner and David Firth 8\nFmri: A package for analyzing fmri dataJörg Polzehl and Karten Tabelow 13\nOptmatch: Flexible, optimal matching for observational studiesBen B. Hansen 18\nRandom survival forests for RHemant Ishwaran and Udaya B. Kogalur 25\nRwui: A web application to create user friendly web interfaces for R scriptsRichard Newton and Lorenz Wernisch 32\nThe np package: Kernel methods for categorical and continuous dataTristen Hayfield and Jeffrey S. Racine 35\neiPack: {R} ecological inferences and higher-dimension data managementOlivia Lau, Ryan T. Moore and Michael Kellermann 43\nThe ade4 package–II: Two-table and {K}-table methodsStéphane Dray, Anne B. Dufour and Daniel Chessel 47\nReview of “The R Book”Friedrich Leisch 53\nNews and Notes\nChanges in R 2.6.0R Core Team 54\nChanges on CRANKurt Hornik 61\nR Foundation NewsKurt Hornik 72\nNews from the Bioconductor ProjectHervé Pagès and Martin Morgan 73\nPast Events: useR! 2007Duncan Murdoch and Martin Maechler 74\nForthcoming Events: useR! 2008Uwe Ligges, Achim Zeileis, Claus Weihs, Gerd Kopp, Friedrich Leisch and Torsten Hothorn 75\nForthcoming Events: R Courses in MunichFriedrich Leisch 76\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2007-1/",
    "title": "R News Volume 7/1",
    "description": "Articles published in the April 2007 issue of R News",
    "author": [],
    "date": "2007-04-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialTorsten Hothorn 1\nContributed Research Articles\nViewing binary files with the hexView packagePaul Murrell 2\nFlexMix: An R package for finite mixture modellingBettina Grün and Friedrich Leisch 8\nUsing R to perform the AMMI analysis on agriculture variety trialsAndrea Onofri and Egidio Ciriciofolo 14\nInferences for ratios of normal meansGemechis Dilba, Frank Schaarschmidt and Ludwig A. Hothorn 20\nWorking with unknown valuesGregor Gorjanc 24\nA new package for fitting random effect modelsJochen Einbeck, John Hinde and Ross Darnell 26\nAugmenting R with Unix toolsAndrew Robinson 30\nPOT: Modelling peaks over a thresholdMathieu Ribatet 34\nBacktestsKyle Campbell, Jeff Enos, Daniel Gerlanc and David Kane 36\nReview of John Verzani’s book: Using R for Introductory StatisticsAndy Liaw 41\nNews and Notes\nDSC 2007Hadley Wickham 42\nChanges in R 2.5.0R Core Team 43\nForthcoming Events: useR! 2007Dianne Cook 43\nNew Journal: Annals of Applied StatisticsBradley Efron 43\nChanges on CRANKurt Hornik 51\nR Foundation NewsKurt Hornik 56\nR News Referees 2006Torsten Hothorn 56\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2006-5/",
    "title": "R News Volume 6/5",
    "description": "Articles published in the December 2006 issue of R News",
    "author": [],
    "date": "2006-12-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialWolfgang Huber and Paul Murrell 1\nContributed Research Articles\nGraphs and networks: Tools in BioconductorLi Long and Vince Carey 2\nModeling package dependencies using graphsSeth Falcon 8\nImage analysis for microscopy screensOleg Sklyar and Wolfgang Huber 12\nBeadarray: An R package to analyse Illumina BeadArraysMark Dunning, Mike Smith, Natalie Thorne and Simon Tavaré 17\nTranscript mapping with high-density tiling arraysMatthew Ritchie and Wolfgang Huber 23\nAnalyzing flow cytometry data with BioconductorNolwenn Le Meur and Florian Hahne 27\nProtein complex membership estimation using apComplexDenise Scholtens 32\nSNP metadata access and use with BioconductorVince Carey 36\nIntegrating biological data resources into R with biomaRtSteffen Durinck 40\nIdentifying interesting genes with siggenesHolger Schwender, Andreas Krause and Katja Ickstadt 45\nReverse engineering genetic networks using the GeneNet packageJuliane Schäfer, Rainer Opgen-Rhein and Korbinian Strimmer 50\nA multivariate approach to integrating datasets using made4 and ade4Aedín C. Culhane and Jean Thioulouse 54\nUsing amap and ctc packages for huge clusteringAntoine Lucas and Sylvain Jasson 58\nModel-based microarray image analysisChris Fraley and Adrian E. Raftery 60\nSample size estimation for microarray experiments using the ssize packageGregory R. Warnes 64\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2006-4/",
    "title": "R News Volume 6/4",
    "description": "Articles published in the October 2006 issue of R News",
    "author": [],
    "date": "2006-10-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialPaul Murrell 1\nContributed Research Articles\nSweave and the open document format – the odfWeave packageMax Kuhn 2\nPlotrixJim Lemon 8\nRpanel: Making graphs move with tcltkAdrian Bowman, Ewan Crawford and Richard Bowman 12\nR’s role in the climate change debate.Matthew Pocernich 17\nInteracting with data using the filehash packageRoger D. Peng 19\nSpecial functions in R: Introducing the gsl packageRobin K. S. Hankin 24\nA short introduction to the SIMEX and MCSIMEXWolfgang Lederer and Helmut Küchenhoff 26\nParametric links for binary responseRoger Koenker 32\nA new package for the Birnbaum-Saunders distributionVíctor Leiva, Hugo Hernández and Marco Riquelme 35\nReview of Fionn Murtagh’s book:\ncorrespondence analysis and data coding with Java and RSusan Holmes 41\nR Help Desk: Accessing the sourcesUwe Ligges 43\nNews and Notes\nuseR! 2006, The Second R User ConferenceBalasubramanian Narasimhan 45\nChanges in RR Core Team 46\nChanges on CRANKurt Hornik 55\nNews from the Bioconductor ProjectSeth Falcon 63\nR Foundation NewsKurt Hornik 63\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2006-3/",
    "title": "R News Volume 6/3",
    "description": "Articles published in the August 2006 issue of R News",
    "author": [],
    "date": "2006-08-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialRon Wehrens and Paul Murrell 1\nContributed Research Articles\nNon-linear regression for optimising the separation of carboxylic acidsPeter Watkins and Bill Venables 2\nThe pls packageBjørn-Helge Mevik 12\nSome applications of model-based clustering in chemistryChris Fraley and Adrian E. Raftery 17\nMapping databases of X-ray powder patternsRon Wehrens and Egon Willighagen 24\nGenerating, using and visualizing molecular information in RRajarshi Guha 28\nNews and Notes\nFitting dose-response curves from bioassays and toxicity testingJohannes Ranke 7\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2006-2/",
    "title": "R News Volume 6/2",
    "description": "Articles published in the May 2006 issue of R News",
    "author": [],
    "date": "2006-05-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialPaul Murrell 1\nContributed Research Articles\nS4 classes for distributionsPeter Ruckdeschel, Matthias Kohl, Thomas Stabla and Florian Camphausen 2\nThe regress functionDavid Clifford and Peter McCullagh 6\nProcessing data for outliersLukasz Komsta 10\nAnalysing equity portfolios in RDavid Kane and Jeff Enos 13\nGroupSeq: Designing clinical trials using group sequential designsRoman Pahl, Andreas Ziegler and Inke R. König 21\nUsing R/Sweave in everyday clinical practiceSven Garbade and Peter Burgard 26\nchangeLOS: An R-package for change in length of hospital stay based on the Aalen-Johansen estimatorM. Wangler, J. Beyersmann and M. Schumacher 31\nBalloon plotNitin Jain and Gregory R. Warnes 35\nDrawing pedigree diagrams with R and graphvizJing Hua Zhao 38\nNon-standard fonts in PostScript and PDF graphicsPaul Murrell and Brian Ripley 41\nThe doBy packageSøren Højsgaard 47\nNormed division algebras with R: Introducing the onion packageRobin K. S. Hankin 49\nElectrical properties of resistor networksRobin K. S. Hankin 52\nNews and Notes\nResistor networks R: Introducing the ResistorArray packageRobin K. S. Hankin 52\nChanges in RR Core Team 54\nThe good, the bad, and the ugly—Review of Paul Murrell’s new book: “R Graphics”David Meyer 54\nChanges on CRANKurt Hornik 64\nNews from the Bioconductor ProjectSeth Falcon 70\nR Foundation NewsKurt Hornik 70\nForthcoming Events: DSC 2007Paul Murrell, Ross Ihaka, David Scott and Thomas Yee 71\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2006-1/",
    "title": "R News Volume 6/1",
    "description": "Articles published in the March 2006 issue of R News",
    "author": [],
    "date": "2006-03-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialMartyn Plummer and Paul Murrell 1\nContributed Research Articles\nApplied Bayesian inference in R using MCMCpackAndrew D. Martin and Kevin M. Quinn 2\nCODA: Convergence diagnosis and output analysis for MCMCMartyn Plummer, Nicky Best, Kate Cowles and Karen Vines 7\nBayesian software validationSamantha Cook and Andrew Gelman 11\nMaking BUGS openAndrew Thomas, Bob OH́ara, Uwe Ligges and Sibylle Sturtz 12\nThe BUGS languageAndrew Thomas 17\nBayesian data analysis using RJouni Kerman and Andrew Gelman 21\nNews and Notes\nErratum 24\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2005-2/",
    "title": "R News Volume 5/2",
    "description": "Articles published in the November 2005 issue of R News",
    "author": [],
    "date": "2005-11-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialDouglas Bates 1\nContributed Research Articles\nBMA: An R package for Bayesian model averagingAdrian E. Raftery, Ian S. Painter and Christopher T. Volinsky 2\nClasses and methods for spatial data in REdzer J. Pebesma and Roger S. Bivand 9\nRunning long R jobs with Condor DAGXianhong Xie 13\nRstream: Streams of random numbers for stochastic simulationPierre L’Ecuyer and Josef Leydold 16\nMfp: Multivariable fractional polynomialsAxel Benner 20\nCrossdes: A package for design and randomization in crossover studiesOliver Sailer 24\nR Help Desk: Make “R CMD” work under Windows – an exampleUwe Ligges and Duncan Murdoch 27\nNews and Notes\nR Help DeskUwe Ligges and Duncan Murdoch 27\nChanges in RR Core Team 29\nChanges on CRANKurt Hornik 35\nForthcoming Events: useR! 2006 43\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2005-1/",
    "title": "R News Volume 5/1",
    "description": "Articles published in the May 2005 issue of R News",
    "author": [],
    "date": "2005-05-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialDouglas Bates 1\nContributed Research Articles\nInternationalization features of R 2.1.0Brian D. Ripley 2\nPackages and their management in R 2.1.0Brian D. Ripley 8\nRecent changes in grid graphicsPaul Murrell 12\nHoa: An R package bundle for higher order likelihood inferenceAlessandra Brazzale 20\nFitting linear mixed models in RDouglas Bates 27\nUsing R for statistical seismologyRay Brownrigg and David Harte 31\nLiterate programming for creating and maintaining packagesJonathan Rougier 35\nCRAN task viewsAchim Zeileis 39\nUsing control structures with SweaveDamian Betebenner 40\nThe value of R for preclinical statisticiansBill Pikounis and Andy Liaw 44\nRecreational mathematics with R: Introducing the “magic” packageRobin K. S. Hankin 48\nProgrammer’s Niche: How do you spell that number?John Fox 51\nNews and Notes\nProgrammer’s NicheJohn Fox 51\nBook Review of Julian J. Faraway: Linear Models with RThomas Yee 56\nChanges in RR Core Team 57\nR Foundation NewsBettina Grün 57\nChanges on CRANKurt Hornik 67\nEvents 71\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2004-2/",
    "title": "R News Volume 4/2",
    "description": "Articles published in the September 2004 issue of R News",
    "author": [],
    "date": "2004-09-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialThomas Lumley 1\nContributed Research Articles\nLazy loading and packages in R 2.0.0Brian D. Ripley 2\nFonts, lines, and transparency in R graphicsPaul Murrell 5\nThe NMMAPSdata packageRoger D. Peng and Leah J. Welty 10\nLaying out pathways with RgraphvizJeff Gentry, Vincent Carey, Emden Gansner and Robert Gentleman 14\nFusing R and BUGS through WineJun Yan 19\nR package maintenancePaul Gilbert 21\nNews and Notes\nChanges in RR Core Team 24\nChanges on CRANKurt Hornik 32\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2004-1/",
    "title": "R News Volume 4/1",
    "description": "Articles published in the June 2004 issue of R News",
    "author": [],
    "date": "2004-06-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialThomas Lumley 1\nContributed Research Articles\nThe decision to use RMarc Schwartz 2\nThe ade4 package — I: One-table methodsDaniel Chessel, Anne B. Dufour and Jean Thioulouse 5\nQcc: An R package for quality control charting and statistical process controlLuca Scrucca 11\nLeast squares calculations in RDouglas Bates 17\nTools for interactively exploring R packagesJianhua Zhang and Robert Gentleman 20\nThe survival packageThomas Lumley 26\nR Help Desk: Date and time classes in RGabor Grothendieck and Thomas Petzoldt 29\nProgrammers’ Niche: A simple class, in S3 and S4Thomas Lumley 33\nNews and Notes\nuseR! 2004John Fox 28\nR Help DeskGabor Grothendieck and Thomas Petzoldt 29\nProgrammers’ NicheThomas Lumley 33\nChanges in RR Core Team 36\nChanges on CRANKurt Hornik 41\nR Foundation NewsBettina Grün 46\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2003-3/",
    "title": "R News Volume 3/3",
    "description": "Articles published in the December 2003 issue of R News",
    "author": [],
    "date": "2003-12-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialFriedrich Leisch 1\nContributed Research Articles\nDimensional reduction for data mappingJonathan Edwards and Paul Oman 2\nR as a simulation platform in ecological modellingThomas Petzoldt 8\nUsing R for estimating longitudinal student achievement modelsJ. R. Lockwood, Harold Doran and Daniel F. McCaffrey 17\nlmeSplinesRod Ball 24\nDebugging without (too many) tearsMark Bravington 29\nThe R2HTML packageEric Lecoutre 33\nR Help Desk: Package managementUwe Ligges 37\nFitting dose-response curves from bioassays and toxicity testingJohannes Ranke 7\nNews and Notes\nR Help DeskUwe Ligges 37\nProgrammer’s NicheThomas Lumley 40\nRecent EventsKrisztina Filep 41\nUpcoming EventsR core team mem- bers: 42\nChanges in R 1.8.1R Core Team 43\nChanges on CRANKurt Hornik and Friedrich Leisch 43\nR Foundation NewsBettina Grün 45\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2003-2/",
    "title": "R News Volume 3/2",
    "description": "Articles published in the October 2003 issue of R News",
    "author": [],
    "date": "2003-10-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialFriedrich Leisch 1\nContributed Research Articles\nR Help Desk: An introduction to using R’s base graphicsMarc Schwartz 2\nIntegrating grid graphics output with base graphics outputPaul Murrell 7\nA new package for the general error distributionAngelo Mineo 13\nWeb-based microarray analysis using BioconductorColin A. Smith 17\nSweave, part II: Package vignettesFriedrich Leisch 21\nNews and Notes\nR Help DeskMarc Schwartz 2\nR Foundation NewsBettina Grün and Friedrich Leisch 25\nRecent EventsGünther Sawitzki, Friedrich Leisch, Balasubramanian Narasimhan and Claus Dethlefsen 26\nBook ReviewsBret Larget 28\nChanges in R 1.8.0R Core Team 29\nChanges on CRANKurt Hornik and Friedrich Leisch 35\nCrossword SolutionBarry Rowlingson 38\nCorrection to “Building Microsoft Windows Versions of R and R packages under Intel Linux”Jun Yan and A.J. Rossini 39\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2003-1/",
    "title": "R News Volume 3/1",
    "description": "Articles published in the June 2003 issue of R News",
    "author": [],
    "date": "2003-06-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialFriedrich Leisch 1\nContributed Research Articles\nName space management for RLuke Tierney 2\nConverting packages to S4Douglas Bates 6\nThe genetics packageGregory R. Warnes 9\nVariance inflation factorsJürgen Groß 13\nBuilding Microsoft Windows versions of R and R packages under Intel LinuxJun Yan and A. J. Rossini 15\nAnalysing survey data in RThomas Lumley 17\nComputational gains using RPVM on a Beowulf clusterBrett Carson, Robert Murison and Ian A. Mason 21\nR Help Desk: Getting help – R’s help facilities and manualsUwe Ligges 26\nNews and Notes\nR Help DeskR Development Core 26\nBook ReviewsKevin Wright, Andy Liaw and Friedrich Leisch 28\nChanges in R 1.7.0R Core Team 31\nChanges on CRANKurt Hornik and Friedrich Leisch 36\nCrosswordBarry Rowlingson 39\nRecent EventsTorsten Hothorn 40\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2002-3/",
    "title": "R News Volume 2/3",
    "description": "Articles published in the December 2002 issue of R News",
    "author": [],
    "date": "2002-12-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialKurt Hornik 1\nContributed Research Articles\nResampling methods in R: The boot packageAngelo J. Canty 2\nDiagnostic checking in regression relationshipsAchim Zeileis and Torsten Hothorn 7\nDelayed data packagesDavid E. Brahm 11\nGeepack: Yet another package for generalized estimating equationsJun Yan 12\nOn multiple comparisons in RFrank Bretz, Torsten Hothorn and Peter Westfall 14\nClassification and regression by randomForestAndy Liaw and Matthew Wiener 18\nSome strategies for dealing with genomic dataRobert Gentleman 22\nChanges to the R-Tcl/Tk packagePeter Dalgaard 25\nSweave, part I: Mixing R and LaTeXFriedrich Leisch 28\nR Help Desk: Automation of mathematical annotation in plotsUwe Ligges 32\nNews and Notes\nSweave, Part I: Mixing R and LFriedrich Leisch 28\nR Help DeskUwe Ligges 32\nChanges in RR Core Team 34\nChanges on CRANKurt Hornik 37\nNew Publications 38\ngRaphical Models in RSteffen L. Lauritzen 39\nRecent and Upcoming EventsJohn Fox, Karl W. Broman, Friedrich Leisch and Stefano Iacus 39\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2002-2/",
    "title": "R News Volume 2/2",
    "description": "Articles published in the June 2002 issue of R News",
    "author": [],
    "date": "2002-06-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialKurt Hornik 1\nContributed Research Articles\nTime series in R 1.5.0Brian D. Ripley 2\nNaive time series forecasting methodsDavid Meyer 7\nRmpi: Parallel statistical computing in RHao Yu 10\nThe grid graphics packagePaul Murrell 14\nLatticeDeepayan Sarkar 19\nProgrammer’s NicheBill Venables 24\ngeoRglm: A package for generalised linear spatial modelsOle F. Christensen and Paulo J. Ribeiro 26\nQuerying PubMedRobert Gentleman and Jeff Gentry 28\nEvd: Extreme value distributionsAlec Stephenson 31\nIpred: Improved predictorsAndrea Peters, Torsten Hothorn and Berthold Lausen 33\nNews and Notes\nChanges in RR Core Team 36\nChanges on CRANKurt Hornik 43\nUpcoming EventsKurt Hornik and Friedrich Leisch 44\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2002-1/",
    "title": "R News Volume 2/1",
    "description": "Articles published in the March 2002 issue of R News",
    "author": [],
    "date": "2002-03-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialKurt Hornik 1\nContributed Research Articles\nReading foreign filesDuncan Murdoch 2\nMaximally selected rank statistics in RTorsten Hothorn and Berthold Lausen 3\nQuality control and early diagnostics for cDNA microarraysGünther Sawitzki 6\nBioconductorRobert Gentleman and Vincent Carey 11\nAnalyzeFMRI: An R package for the exploration and analysis of MRI and fMRI datasetsJonathan Marchini 17\nUsing R for the analysis of DNA microarray dataSandrine Dudoit, Yee Hwa Yang and Ben Bolstad 24\nNews and Notes\nChanges in R 1.4.0R Core Team 32\nChanges in R 1.4.1R Core Team 39\nChanges on CRANKurt Hornik and Friedrich Leisch 40\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2001-3/",
    "title": "R News Volume 1/3",
    "description": "Articles published in the September 2001 issue of R News",
    "author": [],
    "date": "2001-09-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialFriedrich Leisch 1\nContributed Research Articles\nPorting R to Darwin/X11 and Mac OS XJan Leeuw 2\nRPVM: Cluster statistical computing in RMichael Na Li and A. J. Rossini 4\nStrucchange: Testing for structural change in linear regression relationshipsAchim Zeileis 8\nProgrammer’s Niche: Macros in RThomas Lumley 11\nMore on spatial dataRoger Bivand 13\nObject-oriented programming in RJohn M. Chambers and Duncan Temple Lang 17\nIn search of C/C++ & FORTRAN routinesDuncan Temple Lang 20\nSupport vector machinesDavid Meyer 23\nA primer on the R-Tcl/Tk packagePeter Dalgaard 27\nWle: A package for robust statistics using weighted likelihoodClaudio Agostinelli 32\nNews and Notes\nChanges on CRANKurt Hornik and Friedrich Leisch 38\nChanges in RR Core Team 40\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2001-2/",
    "title": "R News Volume 1/2",
    "description": "Articles published in the June 2001 issue of R News",
    "author": [],
    "date": "2001-06-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialKurt Hornik and Friedrich Leisch 1\nContributed Research Articles\nDate-time classesBrian D. Ripley and Kurt Hornik 8\nInstalling R under WindowsBrian D. Ripley 11\ngeoR: A package for geostatistical analysisPaulo J. Ribeiro, Jr. and Peter J. Diggle 14\nSimulation and analysis of random fieldsMartin Schlather 18\nMgcv: GAMs and generalized ridge regression for RSimon N. Wood 20\nWhat’s the point of “tensor”?Jonathan Rougier 26\nOn multivariate t and Gauß probabilities in RTorsten Hothorn, Frank Bretz and Alan Genz 27\nNews and Notes\nChanges in RR Core Team 2\nChanges on CRANKurt Hornik and Friedrich Leisch 5\nSpatial Statistics in RBrian D. Ripley 14\nProgrammer’s NicheBill Venables 29\nRecent EventsFriedrich Leisch 32\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  },
  {
    "path": "issues/2001-1/",
    "title": "R News Volume 1/1",
    "description": "Articles published in the January 2001 issue of R News",
    "author": [],
    "date": "2001-01-01",
    "categories": [],
    "contents": "\n\nComplete issue \nTable of contents\nEditorialKurt Hornik and Friedrich Leisch 1\nContributed Research Articles\nUnder new memory managementLuke Tierney 10\nOn exact rank tests in RTorsten Hothorn 11\nPorting R to the MacintoshStefano M. Iacus 13\nThe density of the non-central chi-squared distribution for large values of the noncentrality parameterPeter Dalgaard 14\nConnectionsBrian D. Ripley 16\nUsing databases with RBrian D. Ripley 18\nRcgi 4: Making web statistics even easierM. J. Ray 20\nOmegahat packages for RJohn M. Chambers and Duncan Temple Lang 21\nUsing XML for statistics: The XML packageDuncan Temple Lang 24\nProgrammer’s NicheBill Venables 27\nNews and Notes\nWhat is R?R Core Team 2\nR ResourcesR Core Team 3\nChanges in RR Core Team 4\nChanges on CRANKurt Hornik and Friedrich Leisch 8\nWriting Articles for R NewsFriedrich Leisch 30\nUpcoming EventsKurt Hornik 32\n\n\n",
    "preview": {},
    "last_modified": "2025-11-25T05:57:00+00:00",
    "input_file": {}
  }
]
